#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Copyright (c) ***
import os
from entity_describe_data_p1 import d
from utils.neo_function import split_str
from nlp_applications.data_loader import load_json_line_data


entity_describe = [
    {"entity": "江苏恒瑞医药股份有限公司", "sentence": "江苏恒瑞医药股份有限公司是一家从事医药创新和高品质药品研发、生产及推广的医药健康企业"}
]


remove_title = ["心理学", "设计模式", "2003年7月", "Wiki", "操作系统列表", "亳州市", "材料科学", "中国历史", "语言列表",
                           "秦汉三国历史年表", "人物", "教育", "隋唐五代十国历史年表", "中国省级行政区面积列表", "中华人民共和国各省级行政区人口列表", "江苏省",
                           "中华人民共和国各省级行政区人口密度列表",
                           "JavaScript", "法国历史", "台湾国旗", "文明摇篮", "全球反对对伊战争大游行", "倩女幽魂 (1987年电影)", "元素列表",
                           "化学家列表", "摩托车", "松山区", "剧场", "各国人口列表", "国际电话区号列表", "彝族", "中华人民共和国历史年表", "中华民国大陆时期历史年表",
                           "GTK+", "GIMP", "德国", "南亚", "艾滋病名人列表", "生物病毒分类表", "师傅", "太白", "白血球", "中国大陆高等学校列表", "1949年",
                           "巴鲁赫·斯宾诺莎", "数量级 (时间)", "清华大学", "英国大学列表",
                           "互联网顶级域列表", "1960年", "左丘明", "黑暗时代", "风车", "黄河", "1119年", "数学家列表", "1114年", "官方语言列表", "1983年",
                           "计算机科学家列表", "图形文件格式比较", "历史上的今天", "澳大利亚",
                           "2003年4月", "星座面积列表", "2003年6月", "456年", "457年", "458年", "世界宗教列表", "化学物质列表", "物理学家列表",
                           "世界宗教列表", "加拿大同性婚姻", "诸子百家", "清福陵", "美国历史年表",
                           "美国各州人口列表", "江青 (消歧义)", "1976年", "1977年", "姓氏", "姓", "顺治帝", "图书馆信息学", "美国各州面积列表", "美国历史",
                           "古典主义时期歌剧", "中国图书馆分类法 (O)",
                           "中国图书馆分类法 (Z)", "中国学科分类国家标准/110", "中国学科分类国家标准/120", "中国学科分类国家标准/130", "中国学科分类国家标准/140",
                           "中国学科分类国家标准/150", "中国学科分类国家标准/160",
                           "中国学科分类国家标准/170", "中国学科分类国家标准/180", "中国学科分类国家标准/210", "中国学科分类国家标准/220", "中国学科分类国家标准/230",
                           "中国学科分类国家标准/240",
                           "中国学科分类国家标准/310", "中国学科分类国家标准/320", "中国学科分类国家标准/330", "中国学科分类国家标准/340", "中国学科分类国家标准/350",
                           "中国学科分类国家标准/360",
                           "中国学科分类国家标准/410", "中国学科分类国家标准/420", "中国学科分类国家标准/430", "中国学科分类国家标准/440", "中国学科分类国家标准/450",
                           "中国学科分类国家标准/460",
                           "中国学科分类国家标准/470", "中国学科分类国家标准/480", "中国学科分类国家标准/490", "中国学科分类国家标准/510", "中国学科分类国家标准/520",
                           "中国学科分类国家标准/530",
                           "中国学科分类国家标准/540", "中国学科分类国家标准/550", "中国学科分类国家标准/560", "中国学科分类国家标准/570", "中国学科分类国家标准/580",
                           "中国学科分类国家标准/590",
                           "中国学科分类国家标准/610", "中国学科分类国家标准/620", "中国学科分类国家标准/630", "中国学科分类国家标准/710", "中国学科分类国家标准/720",
                           "中国学科分类国家标准/730",
                           "中国学科分类国家标准/750", "中国学科分类国家标准/760", "中国学科分类国家标准/770", "中国学科分类国家标准/780", "中国学科分类国家标准/790",
                           "中国学科分类国家标准/810",
                           "中国学科分类国家标准/820", "中国学科分类国家标准/830", "中国学科分类国家标准/850", "中国学科分类国家标准/860", "中国学科分类国家标准/870",
                           "中国学科分类国家标准/880",
                           "中国学科分类国家标准/890", "中国学科分类国家标准/910", "日本电影列表", "美国电影列表", "法国电影列表", "德国电影列表", "瑞典电影列表", "矿业工程",
                           "1967年", "算法",
                           "1966年", "导演列表", "中国学科分类国家标准/840", "扇形码", "比利时同性婚姻", "LGBT相关电视节目列表", "LGBT人物列表",
                           "LGBT相关电影列表", "红白机游戏列表", "电信", "各国首都列表", "常见姓氏列表", "恩格尔系数", "克林顿", "统一教对性的看法", "宗教与同性恋", "韦伯",
            "布莱尔", "乔治·布什", "长城 (消歧义)", "华盛顿", "荷兰同性婚姻", "美国同性婚姻", "管弦乐团列表", "歌剧魅影 (音乐剧)", "韩国 (消歧义)", "大阪 (消歧义)", "夏商周年表",
                "非洲历史", "世界语语法", "Hello World", "联合国会员国列表", "欧洲联盟", "第一代编程语言", "巴洛克时期歌剧", "1758年", "前145年", "西藏历史", "1527年", "1118年"
                "2003年", "1937年", "1990年", "2001年", "1854年", "1453年", "1884年", "岳麓山", "2003年8月", "中华人民共和国领导人列表", "701年", "2003年逝世人物列表",
                "黄海海战", "日本县份人口表", "阿炳", "155年", "420年", "心理学家列表", "法华宗", "美国历史 (1865年－1918年)", "平江 (消歧义)", "1938年", "第二次世界大战各国伤亡统计",
                "Microsoft Windows的历史", "2003年9月", "北海", "雷锋纪念馆", "澳大利亚大学列表", "丹麦大学列表", "法国大学列表", "德国大学列表", "洪都拉斯大学列表", "爱尔兰共和国大学列表",
                "台湾大专院校列表", "西班牙大学列表", "菲律宾大学列表", "波兰大学列表", "挪威大学列表", "荷兰大学列表", "新西兰大学列表", "瑞士大学列表", "瑞典大学列表", "斯洛文尼亚大学列表",
                "葡萄牙大学列表", "阿尔巴尼亚大学列表", "比利时大学列表", "爱沙尼亚大学列表", "1378年", "2000年", "1999年", "1998年", "1997年", "美国人口史", "吉尔吉斯", "吉尔吉斯斯坦",
                "米 (消歧义)", "厘米", "世纪", "蒙古人", "格鲁吉亚", "10月14日", "心理学史", "外层空间", "中国乐器列表", "弗洛伊德", "借词", "香港行政区划", "梭罗", "越南民族", "六镇之乱",
                "E (数学常数)", "北京官话", "殷", "商", "西班牙行政区划", "澳洲 (消歧义)", "纪元", "HTML字符编码", "希斯", "西贡", "汤 (消歧义)", "1789年美国总统选举", "中华人民共和国人权",
                "香港儿童文学作家", "洛克", "印度民族", "北区", "中国地理", "西班牙文学", "长沙历史", "象棋 (消歧义)", "Smalltalk", "英联邦", "十国", "台北101", "1990年代", "中国文化 (消歧义)",
                "达尔文", "天皇 (消歧义)", "古希腊数学", "大学 (经传)", "1980年代", "1970年代", "1960年代", "银版摄影法", "1930年代", "1950年代", "1940年代", "日本天皇列表", "茶花女 (消歧义)",
                "古希腊哲学家列表", "尼克松 (消歧义)", "OWL", "芭蕾舞剧列表", "以色列人", "面向对象", "巴赫 (消歧义)", "前16年", "元", "五帝", "秦", "昆虫分类表", "湖南教育", "蚌埠市", "匹配",
                "胡克定律", "多尔衮", "物理学定律列表", "万历朝鲜之役", "合理使用", "费马大定理", "绥靖主义", "军事技术与装备列表", "哈沃德·加德纳", "军事著作", "二十世纪的科学成就", "高雄市 (1979年-2010年)",
                "2003年科技", "海洋", "鲧", "李朝", "东条英机", "吐谷浑首领列表", "2005年逝世人物列表", "丹麦君主列表", "发明家列表", "罗马皇帝列表", "威廉一世", "中信", "基辅罗斯统治者年表", "叶卡捷琳娜一世",
                "彼得一世", "2月24日", "CET", "孙子", "苏联元帅列表", "中华人民共和国出版社列表", "朝鲜汉字", "音乐形式列表", "金酸莓奖", "人大", "前247年", "历史学家列表", "平方", "人民解放军 (消歧义)",
                "中国军事", "埃及神祇列表", "白薇", "文学奖列表", "中国大陆报纸列表", "WCG", "LAN", "孔子弟子列表", "中国基督教史", "中国寺院列表", "黑客", "体育联盟列表", "纳粹德国对同性恋的迫害及屠杀",
                "庞德 (消歧义)", "木星", "月球", "加勒比地区", "苏丹 (消歧义)", "李治 (消歧义)", "米 (单位)", "脱氧核糖核酸", "约翰·哈比森", "翻译 (消歧义)", "同性恋与犹太教", "英国君主列表", "西班牙人口",
                "计算机病毒", "阿根廷", "国际葡萄酒城", "葡萄牙", "沙皇俄国", "俄罗斯历史", "国际组织列表", "马来西亚封衔", "操作系统历史", "伊拉克通讯", "美国人口调查局", "狭义相对论", "张衡 (消歧义)",
                "民建联 (消歧义)", "博斯曼法案", "TCP/UDP端口列表", "TCP", "MS-DOS命令列表", "MSN", "朝鲜问题", "服务器", "刚果", "ISO (消歧义)", "黑河", "大明历", "启明", "尼尔·基诺克", "法国大革命",
                "中国统一", "中国铁路线路列表", "平原君", "战国四公子", "CCTV (消歧义)", "马歇尔", "上海市行政长官列表", "爱国主义", "古诗", "易卜拉欣大惨案", "CPI (消歧义)", "2月26日", "张择端", "史",
                "解剖学史", "世界史年表 (公元前)", "世界史年表", "李斯", "玄奘", "火灾安全科学与工程", "美利坚联盟国", "坦克", "丽水市", "德文 (消歧义)", "考古学家列表", "汉", "李锐", "目", "界",
                "蚩尤 (消歧义)", "中国皇帝", "指挥家列表", "地球物理探勘学", "拜占庭皇帝列表", "卢曼", "动物分类表", "欧洲旗", "韩文 (消歧义)", "文献学", "建兴", "鄱阳湖", "世贸", "中国年号列表",
                "夫人", "相亲数链", "湖南历史", "可持续发展", "湖南地理", "郴州市", "美国性悖轨法", "孙吴 (消歧义)", "代", "韩国行政区划", "王维林", "世界史年表 (1世纪-10世纪)", "独立", "福斯特",
                "陈升 (消歧义)", "中国战争列表", "NBC", "特区", "BBC (消歧义)", "伊朗电影列表", "韩国电影列表", "素数", "丁字", "ATM", "自动柜员机", "IT (消歧义)", "蒙提·派森", "赵薇 (消歧义)",
                "南北朝 (消歧义)", "本命年", "花甲", "中华人民共和国机械电子工业部", "中华人民共和国第五机械工业部", "日 (消歧义)", "中华人民共和国第二轻工业部", "玻色子", "SETI", "宁", "基地",
                "郑国 (消歧义)", "货柜船", "以色列历史", "汤因比", "ER", "伦敦条约", "户口", "天宁寺", "鹿城", "郑", "第二方物流", "建筑 (消歧义)", "失乐园 (消歧义)", "民进党 (消歧义)", "平方米",
                "共和党 (消歧义)", "吴广", "M16", "中国姓氏列表", "何姓", "手冢治虫", "RPG", "约翰·华生", "亚洲四小虎", "VOC", "香港电影列表", "敦", "语言学家列表", "燧人氏", "台北县 (消歧义)",
                "中非", "国家标准", "国标", "数据", "方太", "东区", "红军", "需求", "六十甲子", "夏雨", "泰坦尼克号 (1997年电影)", "法国总统列表", "一塌糊涂"
                           ] + ["{}年".format(i) for i in range(2021)] + ["{0}年{1}月".format(i, j) for i in range(2021) for j in range(1, 13)] + \
               ["前{}年".format(i) for i in range(1, 2000)]

add_title = ["肖申克的救赎", "Windows 2000", "Microsoft Windows", "Windows 98", "Windows 95", "红白机", "霸王别姬 (电影)",
                      "Java", "PlayStation (游戏机)", "阿飞正传", "家有囍事", "激光", "MediaWiki", "利兹大学", "七龙珠",
             "角斗士 (电影)",
             "快乐快乐月刊", "字节", "三国志II 霸王的大陆", "天堂 (游戏)", "城市猎人", "星际争霸 (游戏)", "珠穆朗玛峰", "国产凌凌漆", "雅虎地球村",
             "大城小事 (电影)", "重庆森林", "射雕英雄传之东成西就", "赌圣", "心动", "人民公厕", "春光乍泄", "十七岁的天空"]


def generater_label_single_file(iv):
    data_path = "D:\data\语料库\wiki_zh_2019\wiki_zh\AA\wiki_{:0>2d}".format(iv)

    data = load_json_line_data(data_path)

    for i, dt in enumerate(data):
        # if i > 0:
        #     break
        if dt["title"] in remove_title:
            continue
        entity = dt["title"]
        if entity in d:
            entity = d[entity]

        print(entity)
        # print(dt["text"])
        sentence_generator = split_str(dt["text"], {"。", "？", "！", "!", "?", "\r", "\n"})
        sentence_list = [sentence for v, sentence in enumerate(sentence_generator) if v < 2]
        if len(sentence_list) < 2:
            continue
        sentence = sentence_list[1]
        if entity in add_title:
            sentence = entity + sentence_list[1]
        print(sentence)
        yield {
            "entity": entity,
            "sentence": sentence,
            "entity_start": sentence.index(entity)
        }


start_indx = 41
def generate_label_data(single_one=False):
    entity_des_data = []
    for iv in range(start_indx):
        print(iv, "**************")
        yield from generater_label_single_file(iv)


sohu_path = "D:\data\语料库\sohu-20091019-20130819\sohu-20091019-20130819"
def generate_sohu(input_path):
    file_list = os.listdir(input_path)

    file_first_path = input_path + "\\" + file_list[0]
    with open(file_first_path, "rb") as f:
        data = f.read()
    print(len(data))
    data = data[:4607999].decode("utf-8")
    # data_list = data.split("\n")
    for document in data.split("\n"):
        if document.strip():
            yield document

def generator_weibo_list(i_path):
    file_list = os.listdir(i_path)
    for file in file_list:
        weibo_file_path = i_path + "\\" + file
        with open(weibo_file_path, "r", encoding="utf-8") as f:
            data = f.read()

            for weibo_one in data.split("\n"):
                if weibo_one.strip():
                    yield weibo_one


def generator_wikicn_list(i_path):
    file_list = os.listdir(i_path)
    for file in file_list:
        wiki_file_path = i_path + "\\" + file
        data_list = load_json_line_data(wiki_file_path)
        for data in data_list:
            # print(data["title"])
            yield data["text"]

negative_list = [
    "下图是报名方式和挂牌三四个月代看四次的价格，差不多是七折盘，可以随便买。",
    "食品着色剂是什么东西[並不簡單]",
    "淘气值尾号是3的求抱团",
    "其中红色是曾侵犯过儿童的罪犯，黄色是强奸犯。",
    "下图是新版扉页的设计方案",
    "相机是我完成工作的媒介",
    "而关键是，这些问题也本该是爱情中重要的部分。",
    "足球报是我读中学时代的报刊",
    "下图是前200APP的详细排名",
    "阮在闽南语中意思是我们，这档综艺注重的就是三位经营者之间的互动，还有和客人之间的沟通。",
    "Switch是我的存钱动力",
    "奖品是我自己手绘🎨的恋爱基金卡",
    "图三是Jensen拉克丝rank记录",
    "你说蓝色是你最爱的颜色🔹",
    "图是前天我们去吃的一种饼",
    "配图是我最喜欢的元气棕＋元气灰「人气款必备琥珀瞳」",
    "问题是，Ａ股市场大部分人都是趋势投资者。",
    "原来Ubuntu是这么个意思！",
    "但问题是这些是法院判刑的标准，不是警察出警的标准。",
    "公民意识是什么样的意识"
]

if __name__ == "__main__":
    for data in generater_label_single_file(start_indx):
        print(data)
