# -*- coding: utf-8 -*-
# @Time : 2022/5/27 23:02
# @Author : jack.li
# @Email : jack.li@aishu.cn
# @File : entity_kg.py
# @Project : gdatasvc-ai-zeus
import re
special_entity = {
    "政府": {},
    "乡村": {},
    "公司": {},
    "银行": {},
    "国家": {},
    "商务部": {},
    "国家邮政局": {},
    "Government of India": {},
}

location_entity = {

    "美国": {},
    "英国": {},
    "法国": {},
    "俄罗斯": {},
    "中国": {},
    "加拿大": {},
    "卢森堡": {},
    "沙特本土": {},
    "新加坡": {},
    "尼日利亚": {},
    "安大略省": {},

    "常州": {},
    "佛山市": {},
    "成都": {},
    "南京": {},
    "北京": {},
    "香港": {},
    "澳门": {},
    "宁波": {},
    "云南": {},
    "常德": {},
    "江苏": {},
    "南通": {},
    "宁波市": {},
    "南京市": {},
    "昆山市": {},
    "上海": {},
    "甘肃": {},
    "杭州": {},
    "合肥": {},
    "苏州": {},
    "海淀": {},
    "贵州省": {},
    "陕西省": {},
    "晋城市": {},
    "柳州": {},
    "青岛": {},
    "西安": {},
    "深圳": {},
    "印度": {},
    "芜湖": {},
    "重庆市": {},
    "越南": {},
    "日本": {},
    "青藏": {},
    "海南": {},
    "浙江": {},
    "珠海市": {},
    "珠海": {},
}

person_entity = {
    "于信": {},
    "吴明明": {},
    "宋天漠": {},
    "张亚明": {},
    "张一鸣": {},
    "张红超": {},
    "张正平": {},
    "林长青": {},
    "林秋生": {},
    "林松": {},
    "林宜儒": {},
    "林依轮": {},
    "王岑": {},
    "牛根生": {},
    "牛文文": {},
    "牛凤轩": {},
    "牛丽娜": {},
    "王展": {},
    "王江和": {},
    "王江": {},
    "王新福": {},
    "王慧文": {},
    "王恩杰": {},
    "王思聪": {},
    "王德利": {},
    "王聪": {},
    "王湛": {},
    "王烁": {},
    "王琼": {},
    "王睿": {},
    "班萨尔": {},
    "罗一": {},
    "运动员Lewis Hamilton": {},
    "雷鸣": {},
    "高朋": {},
    "黄允松": {},
    "高贺健": {},
    "麻长炜": {},
    "黄东旭": {},
    "雷军": {},
    "刘强东": {},
    "潘闵": {},
    "何伯权": {},
    "干嘉伟": {},
    "张涛": {},
    "王刚": {},
    "宋欢平": {},
    "韩彩芬": {},
    "辛巴": {},
    "徐小平": {},
    "贾跃亭": {},
    "陈少杰": {},
    "林元庆": {},
    "刘成城": {},
    "张爱志": {},
    "蔡文胜": {},
    "陈旭明": {},
    "罗伟龙": {},
    "丁磊": {},
    "张科": {},
    "陈彤": {},
    "高成": {},
    "陈谏": {},
    "李学凌": {},
    "刘峻": {},
    "曹允东": {},
    "陈彧堃": {},
    "何劲鹏": {},
    "陈华": {},
    "刘军": {},
    "王柯": {},
    "张洋": {},
    "张帆": {},
    "张筱燕": {},
    "龚瑞丽": {},
    "赵瑞宾": {},
    "郭建军": {},
    "赵瑞杰": {},
    "赵瑞海": {},
    "刘璇": {},
    "卢蓉": {},
    "杨志远": {},
    "陆石": {},
    "龚虹嘉": {},
    "秦致": {},
    "樊峥": {},
    "章泽天": {},
    "李骥": {},
    "夏锎": {},
    "戴雨森": {},
    "王岳华": {},
    "张立功": {},
    "温雷": {},
    "刘超": {},
    "张梅": {},
    "张江集": {},
    "张瑞祺": {},
    "俞永福": {},
    "盛华安": {},
    "吴宵光": {},
    "郑志明": {},
    "李治国": {},
    "张首晟": {},
    "陈宇凌": {},
    "崔永泉": {},
    "陈德军": {},
    "全正辉": {},
    "吴冬宁": {},
    "唐斌森": {},
    "胡海滔": {},
    "刘谋": {},
    "贾静雯": {},
    "张轩松": {},
    "吴孔兴": {},
    "吴世春": {},
    "吴家荣": {},
    "曾智明": {},
    "王华东": {},
    "彭国红": {},
    "鲁志威": {},
    "赵颖玉": {},
    "赵辉": {},
    "赵愚领": {},
    "赵广斌": {},
    "赖蕴琦": {},
    "赖永赛": {},
    "沈瀚": {},
    "赖丽华": {},
    "黄演": {},
    "张江科": {},
    "陈应魁": {},
    "陈锜": {},
    "黄海": {},
    "金鑫": {},
    "王伟": {},
    "吴忌寒": {},
    "夏冰": {},
    "郑志刚": {},
    "邹东亮": {},
    "邵亦波": {},
    "邱懿武": {},
    "邢玮": {},
    "邓海清": {},
    "谭秉忠": {},
    "谭文松": {},
    "谢锦鹏": {},
    "蔡龙辉": {},
    "蔡景钟": {},
    "蔡志伟": {},
    "蔡崇信": {},
    "蔡东青": {},
    "付栋平": {},
    "谢展": {},
    "谢小波": {},
    "蒋佳学": {},
    "葛越晟": {},
    "符绩勋": {},
    "童士豪": {},
    "章高男": {},
    "章子怡": {},
    "程浩": {},
    "唐磊": {},
    "唐彬森": {},
    "周鸿祎": {},
    "周鸿": {},
    "周逵": {},
    "周洛宏": {},
    "周沙": {},
    "周受资": {},
    "周亚辉": {},
    "吴焯民": {},
    "吴烨峰": {},
    "吴海": {},
    "吴波": {},
    "吴彦祖个人投资者": {},
    "吴咏铭": {},
    "吴伯凡": {},
    "程林发": {},
    "段永平": {},
    "仇泯之": {},
    "章子": {},
    "葛威": {},
    "谢娜": {},
    "谢世煌": {},
    "苗田欣": {},
    "苏长君": {},
    "苏斌": {},
    "严明": {},
    "杨观上": {},
    "杨致远": {},
    "杨清华": {},
    "杨浩涌": {},
    "杨晋": {},
    "杨帆": {},
    "杨川": {},
    "杨国安": {},
    "杨向阳": {},
    "杨冬云": {},
    "杜欣": {},
    "杜桥": {},
    "杜均": {},
    "李静": {},
    "李钢": {},
    "阳陆育": {},
    "李秋祥": {},
    "李璟": {},
    "李欧成": {},
    "李显扬": {},
    "李春安": {},
    "李星星": {},
    "李斌": {},
    "李想": {},
    "李彦宏": {},
    "李开复": {},
    "李康林": {},
    "李国庆": {},
    "李嘉诚": {},
    "李兴妹": {},
    "李兆基": {},
    "李丰": {},
    "李一男": {},
    "朱拥华": {},
    "朱啸虎": {},
    "曾鸣": {},
    "曾峥": {},
    "方敏": {},
    "曾登高": {},
    "袁征": {},
    "戚继光": {},
    "papi酱": {},
    "毛文超": {},
    "谷俊丽博士": {},
    "谭智博士": {},
    "Mike Chalfen": {},
    "三木谷浩史": {},
    "莱万多夫斯基": {},
    "严筱湄 Jennifer": {},
    "CEO王柯": {},
    "阿什顿·库彻": {},
    "萨钦-班萨尔": {},
    "萨钦·班萨尔": {},
    "杰夫": {},
    "开复老师": {},
    "杨炯纬本人": {},
    "蔡东青先生": {},
    "蔚来汽车李斌": {},
    "王小川": {},
    "王天广": {},
    "王国斌": {},
    "王卫": {},
    "王小川个人": {},
    "李想个人": {},
    "巫冠逸先生个人": {},
    "龙蟒集团董事长李家权": {},
    "亚马逊CEO杰夫·贝佐斯": {},
    "美团CEO王兴": {},
    "猎豹移动CEO傅盛": {},
    "王兴美团": {},
    "王兴": {},
    "王亚军": {},
    "58姚劲波": {},
    "美团点评CEO王兴": {},
    "美团网原COO干嘉伟": {},
    "王老吉前董事长施少斌": {},
    "Kathy Fields 博士": {},
    "Kathy Fields 博士": {},
    "co-founder/CTO 黄东旭": {},
    "bilibili CEO陈睿": {},
    "Tim Brown": {},
    "启赋资本合伙人曾峥": {},
    "王小川博士": {},


    "王亚军个": {},
    "腾讯副总裁": {},
    "李先生”": {},

}

colledge_entity = {
    "南京大学": {},
    "清华大学": {},
    "清华": {},
    "电子科技大学": {},
}

right_cannot_link = {
    "个人投资方": {},
    "个人投资者": {},
    "个人投资人": {},
    "数位独立投资人": {},
    "数位个人投资者": {},
    "个人天使投资者": {},
    "个人天使投资人": {},

}

# 名字打错了
right_but_name_not_right = {
    "陈桂香": {},
    "万象文化": {},  # 万像文化
    "中链融信中链融信": {},
}

not_complete = {
    "众能": {},  # 众能联合
    "优客": {},  # 优客工场
    "利农": {},  # 利农集团
    "霄云": {},   # 霄云科技
    "九州": {},  # 九州通

    "一树百": {},  # 一树百获
    "万科置": {},  # 万科置业
    "万科企": {},  # 万科企业
    "万达体育集": {},  # 万达体育集团
    "三只松": {},  # 三只松鼠
    "丰疆智": {},  # 丰疆智能
    "云物联": {},   # 锱云物联
    "九州通S": {},  # 20九州通SCP002
    "京东数": {},  # 京东数码
    "众能联": {},  # 众能联合
    "创业3": {},  # 创业36计
    "包钢股": {}, # 包钢股份
    "华大智": {}, # 华大智造
    "合肥巨量": {},  # 合肥巨量引擎科技有限公司
    "名师工厂": {},  # 101名师工厂
    "工行四川分": {},  # 工行四川分行
    "店匠S": {},   # 店匠Shoplazza
    "府捞面": {},   # 和府捞面
    "弘阳地产集团有限": {},  # 弘阳地产集团有限公司
    "快手科": {},  # 快手科技
    "浙大藕": {},  # 浙大藕舫
    "浅石创": {},  # 浅石创投
    "东方富": {},  # 东方富海
    "东方": {},  # 东方富海,
    "阿联": {},  # 阿联酋
    "阿童木": {},  # 阿童木机器人
    "铭镓半导": {},  # 铭镓半导体
    "铂医药": {},  # 和铂医药,
    "钱方好": {},  # 钱方好近
    "通用净": {},  # 通用净水
    "虎头局渣打": {},  # 虎头局渣打饼
    "通用": {"id": "4afbada4e4d0957eec7935e53800fa5b"}, # 通用净水
    "蘑菇": {}, # 蘑菇物联
    "薄荷健": {}, # 薄荷健康
    "菊花开”卤味": {}, # “菊花开”卤味
    "翼思": {}, # 翼思生物
    "精智未": {}, # 精智未来
    "精智": {}, # 精智未来
    "牛牛": {}, # 币牛牛
    "火花思": {}, # 火花思维,
    "有临": {}, # 有临医药
    "招商局蛇口工业区控": {}, # 招商局蛇口工业区控
    "少年得": {}, # 少年得到
    "少年":  {}, # 少年得到
    "小面": {},  # 遇见小面
    "小象生": {}, # 小象生活
    "宝龙地": {}, # 宝龙地产
    "Wholly Moly! 好哩": {}, # Wholly Moly! 好哩!
    "WeWor": {},  # WeWorK
    "MF": {}, # MFA
    "EASY": {}, # TRAVEL EASY"
    "Cars2": {}, # Cars24
}

duoyu = {
    "为尚·沃特”少儿戏剧": {},  # 为尚·沃特
    "京东计划": {}, # 京东
    "当代集团发": {}, # 当代集团
    "阿里一家": {},  # 阿里,
    "长租公寓安歆集团": {},  # 安歆集团，
    "锅圈刚": {},  # 锅圈
    "茶里两": {},  # 茶里
    "火锅烧烤食材超市“锅圈": {}, # 锅圈
}

not_valid_name = {
    "Pre-IPO": {},
    "Pre-B": {},
    "IMO": {},

    "ToB": {},
    "To B": {},
    "TO B赛道": {},
    "To B企业服务": {},
    "于信创业": {},

    "人民币3亿元": {},
    "人民币15亿元": {},
    "便利": {},
    "国贸中心": {},
    "奈雪的茶市场": {},
    "小程序": {},
    "宅装饰科技": {},
    "工行四川分行": {},
    "广州中华广场资产支持专项计划": {},
    "年产5万吨肉制品数字智能产业基地": {},
    "年产13亿包的工厂": {},

    "小额贷款公司": {},
    "合资公司": {},
    "巴西初创公司": {},

    "拼多多IPO": {},
    "斗鱼IPO": {},
    "快手IPO": {},
    "张亚明公司": {},

    "生活圈": {},
    "赛道": {},
    "邦分享\n三维家": {},
    "长租公寓创投": {},
    "长租公寓ABS": {},
    "王岑创立的": {},
    "王岑创立的B资本": {},


    "个人跟": {},
    "个人投资": {},
    "个人天使": {},

    "青云科技IPO 锅圈": {},

    "英诺": {},
    "松柏": {},
    "海创": {},
    "海龙": {},
    "中科": {},
    "长兴": {},
    "华旦": {},
    "华大": {},
    "光大": {},
    "北金所": {},
    "天润": {},
    "德丰": {},
    "国科": {},
    "国瑞": {},
    "国新": {},
    "祥峰": {},
    "东湖": {},
    "三力": {},

    "东吴": {},


    "领投": {},
    "跟投": {},
    "投资": {},
    "资本": {},
    "资本CCV": {},
    "产业投资": {},
    "天使": {},
    "医药": {},
    "新基金": {},
    "天士": {},
    "支付": {},

    "著名": {},
    "若干": {},
    "接力": {},
    "持续": {},
    "创新": {},
    "创想": {},
    "创业": {},
    "创世": {},
    "关联": {},
    "公元": {},
    "常春藤": {},

    "投资集团": {},
    "若干原有股东": {},
    "某知名投资人": {},
    "著名投资机构": {},
    "某美元基金": {},
    "某著名美元母基金": {},
    "某食品品牌": {},
    "某头部机构": {},
    "某国际产业集团": {},
    "某国家主权基金": {},
    "某光学厂商": {},
    "两家知名产业资本": {},
    "国际投资机构": {},
    "产业基金": {},
    "产业投资者": {},
    "东南亚版小红书": {},
    "该基金": {},
    "互联网头部企业": {},

    "美团5亿美元": {},

    "A轮": {},
    "B轮": {},
    "C轮": {},
    "D轮": {},
    "D2轮": {},
    "Pre-A": {},
    "IPO": {},
    "上市": {},
    "本轮": {},

    "AP": {},
    "AS": {},
    "B2": {},
    "BA": {},
    "BV": {},
    "CD": {},
    "CM": {},
    "D1": {},
    "DC": {},
    "DS": {},
    "G5": {},
    "KD": {},
    "PE": {},
    "RT": {},
    "SI": {},
    "SN": {},
    "VC": {},
    "M1": {},
    "G7": {},

    ". LTD.": {},

    "ceo": {},
    "金山云IPO": {},
    "CEO": {},
    "CMP": {},
    "CVC": {},  # Corporate Venture Capital
    "咖啡": {},
    "新闻资讯APP": {},
    "app": {},
    "to B": {},
    "数据库": {},
    "自有品牌": {},
    "一期基金": {},
    "共享单车": {},

    "BAT": {},
    "四通一达": {},
    "三通一达": {},
    "美团龙珠\n鼎晖投资": {},
    "美团龙珠\n鼎晖": {},
    "浙民投/浙江丝路基金": {},
    "饿了么口碑": {},
    "苏宁家乐福": {},
    "一汽,东风汽车": {},
    "腾讯淡马锡": {},
    "哔哩哔哩bilibili,快手": {},
    "红杉IDG碧桂园": {},
    "红杉高榕": {},

    "王江和张晓高": {},

    "24": {},
    "1990": {},
    "2016": {},
    "103": {},
    "80后": {},
    "10位面老板": {},
    "A+": {"o": "A+品牌直购团"},

    "yPal": {},
    "eGarden\n\nventures": {},
    "人工": {},
    "BOS": {},
    "人工智": {},
    "惠维康": {"o": "柏惠维康"},
    "阿里巴": {},
    "网易集": {}, # 网易集团
    "壁仞科": {"o": "壁仞科技"},
    "永辉超": {},
    "猎豹移": {},
    "经纬中": {}, # 经纬中国
    "阿里健": {},
    "虾米音": {},
    "天图投": {},
    "中信银": {},
    "浦发银": {},
    "中银资": {},
    "今日资": {}, # 今日资本
    "五源资": {}, # 五源资本
    "红杉投": {},
    "中天城": {},
    "软银亚": {},
    "蚂蚁金": {},
    "蚁资本": {},
    "聚明": {},
    "银河": {},
    "源码": {},
    "元气": {},
    "拼多": {},
    "友利": {},
    "远东": {},
    "4DX Venture": {},
    "14 Technologies": {},
    "1畅修保": {}, # 91畅修保
    "新华": {}, # 新华社
    "of": {}, # ofo
    "沃尔": {},
    "小红": {},
    "康恩": {},
    "亚马": {},
    "奈雪": {},
    "饿了": {},
    "科创": {},
    "奈雪的": {},
    "字节跳": {},
    "屈臣": {},
    "致远": {}, # 致远慧图
    "台达": {}, # 台达电
    "三七互": {},
    "小米集": {}, # 小米,集团
    "首创集": {},
    "万达集": {},
    "红杉资本中国基": {}, # 红杉资本中国基金
    "金沙江创": {},
    "种子基金": {},
    "川商基": {},
    "腾讯投": {},
    "创享投": {},
    "火山石投": {},
    "山东省文": {},  # 山东省文投
    "五源资本-": {},
    "小米投资部": {},
    "康众汽": {},
    "康众": {}, # 新康众
    "瑞幸咖": {},
    "京东销": {},
    "软银中": {},  # 软银中囯
    "软银愿": {}, # 软银愿景
    "泰煜投": {},
    "景毅投": {},
    "峰瑞资": {},
    "穆棉资": {},
    "青松资": {},
    "星瀚资": {},
    "华映资": {},
    "辰韬资": {},
    "龙湖资": {},
    "云龙资": {},
    "云沐资": {},
    "云启资": {},
    "海松资": {},
    "龙湖地": {},
    "第五创": {},
    "上汽加州资": {},
    "软银公": {},
    "学大教": {},
    "软银中国资": {},
    "河南省信息产业投资有限": {},
    "浙江坤健信泰股权投资管理有限公": {},
    "金镒资": {},
    "美团龙珠资": {},
    "迪拜酋": {},
    "姚记科": {},
    "奇虎3": {},
    "三木谷": {},
    "人民银": {},
    "1835i Venture": {}, # 1835i Ventures
    "江苏省国": {},
    "王刚的": {},
    "西证投": {},
    "Co": {},
    "千万级": {},
    "相同资": {},
    "者资本": {},
    "100基金": {}, # 创客100基金
    "黑米先": {},  # 黑米先生
    "黄医": {},  # 和黄医药
    "魅力": {},  #  魅力惠
    "饱饱": {}, # 王饱饱
    "苏宁易": {}, # 苏宁易购
    "雾化烟": {}, # Doo品牌雾化烟
    "5Five": {}, # 15Five
    "6氪传媒": {}, # 36氪传媒
    "赛维时代科技股份有限公": {}, # 赛维时代科技股份有限公司
    "金沙江联合资": {}, # 金沙江联合资本

    "震坤行为": {}, # 震坤行

    "O.史密斯": {},
    "KKR错位机会基": {},
    "Third Kind Ventu": {},

    "千亿美元": {},
    "1.2亿美元": {},
    "2.4亿美元": {},
    "1亿美元": {},
    "4.47亿": {},
    "2019年": {},
    "10家店": {},

    "工场": {},
    "网商": {},
    "喜茶入股": {},
    "相同资金": {},
    "坚朗五金数千万": {},
    "中国石油亿级": {},

    "和红杉中国": {},
    "高盛(": {},
    "经纬中国完": {},
    "龙珠资本加": {},
    "3\nCMC资本": {},

    "王琼的SIG": {},

    "前联想副总裁": {},
    "瑞幸上市IPO": {},
    "酷特智能IPO 能链集团": {},
    "斯坦福": {},

    "3C消费品租赁分期平台机蜜": {},
    "阿里巴巴投资有限公司": {"reason": "台湾企业，被解散",
                   "name": "阿里巴巴投資有限公司"},

    "京东快播": {"reason": "没有实体意义"},

    "SaaS": {"reason": "行业"},


    "再次": {},
    "第三": {},
    "电商": {},
    "鲨鱼": {},
    "财报": {},
    "董事长": {},
    "20 豫园商城 SCP0": {}, # 债券
    "16金街01": {},  # 债券
    "20华发实业": {},  # 债券
    "21金科地产": {},  # 债券

    "互联网公司": {},
}

multi_entity = {
    "文和友和巴奴火锅": {},
}

# 特殊類型
special_type = {
    "上市公司": {},
    "MCN机构": {},
    "MCN": {},

    "二手车": {},
    "二手电商": {},
    "中期票据": {},
    "二手车电商平台": {},
    "代餐": {},
    "半导体": {},
    "听障儿童": {},
    "宠物医疗": {},
    "宠物用品": {},
    "宠物食品": {},
    "宠物食品/用品": {},
    "手打柠檬茶": {},
    "茶饮": {},
    "长租公寓": {}, # 領域
    "共享汽车": {}, # 领域
    "共享按摩椅": {},  #
    "共享充电宝": {},  #
    "兰州牛肉拉面": {},  #
    "兰州拉面": {},  #
    "便利店": {},  #
    "低度酒": {},  #

    "长沙新消费赛道": {}, # 领域
    "低度酒赛道": {}, # 领域
    "鸭屎香柠檬茶": {},  # 口味
    "宠物食品领域": {},
    "宠物赛道": {},
    "鲜花电商": {},  # 领域
    "食饮赛道": {},  # 领域
    "食品饮料": {},  # 领域
    "颜值经济": {},  # 行业
    "共享汽车赛道": {}, # 领域
    "预制品赛道": {},  # 领域
    "SaaS赛道": {}, #
    "面食赛道": {},  # 领域
    "面品类": {},  # 领域
    "重庆火锅": {},  # 类型
    "零售云业务": {},  # 业务线
    "金融大数据公司": {}, # 公司类型

    "SaaS行业": {}, #
}

time_date = {
    "去年": {},
    "同年": {},
    "明年": {},
}

# 币种
currency_entity = {
    "人民币": {},
    "日元": {},
    "美元": {},
}


def valid_kh(input_str):
    stack = []
    for s in input_str:
        if s in ["(", "（"]:
            stack.append(s)
        elif s == ")":
            if len(stack) == 0:
                return False
            if stack[-1] != "(":
                return False
            stack.pop()
        elif s == "）":
            if len(stack) == 0:
                return False
            if stack[-1] != "（":
                return False
    return len(stack) == 0

def is_not_valid(input_str, include_person=False):
    if len(input_str) < 2:
        return True
    if len(input_str) > 30:
        return True
    if input_str in special_entity:
        return True
    if input_str in location_entity:
        return True
    if not include_person and input_str in person_entity:
        return True
    if input_str in colledge_entity:
        return True
    if input_str in not_valid_name:
        return True
    if input_str in time_date:
        return True
    if input_str in currency_entity:
        return True
    if input_str[0] in ["①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑩", "⑨"]:
        return True
    if input_str[0] in ["，", "?", "©"]:
        return True

    if input_str[0] in ["&", "#", "*", "%", "@", "$", "＃", " ", '\uf0a7']:
        return True
        #     print([input_str[:2]],)
    if input_str[:2] in ['️\xa0']:
        return True
    if input_str[-1] in ["；", "－", "&", "*"]:
        return True
    if input_str[-3:] in ["CEO"]:
        return True

    if input_str[-1] in ["-", "（", "。"]:
        return True

    if not valid_kh(input_str):
        return True

    if "（" in input_str and "）" not in input_str:
        return True
    if "（" not in input_str and "）" in input_str:
        return True
    # 个人
    if input_str[-2:] == "个人":
        return True
    # 个人
    if input_str[-2:] == "先生":
        return True
        # 指向不明
    if input_str[0] == "某":
        return True
        # 指向不明 例如知名PE机构
    if input_str[:2] == "知名":
        return True
        # mention 错误 普罗资本旗下
    if input_str[-2:] == "旗下":
        return True

        # mention 错误 中信产业基金旗下基金
    if input_str[-4:] == "旗下基金":
        return True
        # 1000万
    if re.match("\d+万", input_str):
        return True
        # 厦门政府
    if input_str[-2:] == "政府":
        return True
        # 10亿元
    if re.match("\d+亿元", input_str):
        return True
        # 300亿
    if re.match("\d+亿", input_str):
        return True
        # 5000万美元
    if re.match("\d+万美元?", input_str):
        return True
        # 约3000万美元
    if re.match("约\d+万美元", input_str):
        return True
        # "1.2亿美元"
    if re.match("\d\{1,3}.\d{1,3}亿美元", input_str):
        return True
        # "1亿美元"
    if re.match("\d+亿美元", input_str):
        return True
        # 1124.48亿元
    if re.match("\d{1,4}\.\d{1,4}亿元", input_str):
        return True
        # 500—5000万元
    if re.match("\d{1,4}—\d{1,4}万元", input_str):
        return True
        # 2019年
    if re.match("\d{1,4}年", input_str):
        return True

        # 高秉强教授
    if input_str[-2:] == "教授":
        return True
        # 4家子公司
    if re.match("\d{1,2}家子公司", input_str):
        return True

        # 7月
    if re.match("\d{1,2}月", input_str):
        return True
    if "📸️" in input_str:
        return True
    if "💇" in input_str:
        return True
    if "\n" in input_str:
        return True
    if ";" in input_str:
        return True
    if "，" in input_str:
        return True
    if "、" in input_str:
        return True
    if "：" in input_str:
        return True
    if "？" in input_str:
        return True
    if "。" in input_str:
        return True
    if "?" in input_str:
        return True
    if "⑩" in input_str:
        return True
    if "《" in input_str:
        return True
    if ":" in input_str:
        return True
    if ") " in input_str and "(" not in input_str:
        return True
    if ") " not in input_str and "(" in input_str:
        return True
    if "）" not in input_str and "（" in input_str:
        return True
    if "）" in input_str and "（" not in input_str:
        return True
    if input_str[-1] in ["·", "( ", "。", "，", "、", "(", ".", "、", "：", ":"]:
        return True
        # print(input_str[0])
    if input_str[0] in ["！", "，", "”", "“", "‘", "、", ". ", "》", ".", "\n", "；"]:
        return True
    if "******" in input_str:
        return True
    if re.match("\d个月", input_str):
        return True
    if re.match("月\d+", input_str):
        return True
    if re.match("共有\d", input_str):
        return True
    if re.match("\d\.\d万亿", input_str):
        return True
    if re.match("\d{1,3}\.\d{1,3} \d{1,3}\.\d{1,3}", input_str):
        return True
    if re.match("规模为\d", input_str):
        return True
    if input_str[:3] == "以下是":
        return True
    if input_str[:3] in ["成交额", "交易额"]:
        return True
    if input_str[-3:] in ["笔融资"]:
        return True
    if input_str[:4] in ["CEO "]:
        return True
    if re.match("[\u4e00-\u9fa5]{1,3} [\u4e00-\u9fa5]{1,3}", input_str):
        return True
        # 1000万
    if re.match("\d+万", input_str):
        return True
        # 厦门政府
    if input_str[-2:] == "政府":
        return True
        # 10亿元
    if re.match("\d+亿元", input_str):
        return True
        # 300亿
    # 金钱处理
    if re.match("\d+亿", input_str):
        return True
        # 5000万美元
    if re.match("\d+万美元?", input_str):
        return True
        # 约3000万美元
    if re.match("约\d+万美元", input_str):
        return True
        # "1.2亿美元"
    if re.match("\d\{1,3}.\d{1,3}亿美元", input_str):
        return True
        # "1亿美元"
    if re.match("\d+亿美元", input_str):
        return True
        # 1124.48亿元
    if re.match("\d{1,4}\.\d{1,4}亿元", input_str):
        return True
        # 500—5000万元
    if re.match("\d{1,4}—\d{1,4}万元", input_str):
        return True
        # 2019年
    if re.match("\d{1,4}年", input_str):
        return True
        # 7月
    if re.match("\d{1,2}月", input_str):
        return True
    return False


if __name__ == "__main__":
    is_not_valid("2019年")
