#!/usr/bin/env python
# -*- coding:utf-8 -*-
"""
    @Time : 2022/5/30 15:42
    @Author  : jack.li
    @Site    : 
    @File    : industry_kg.py

"""
import json

industry_list = ['农业', '林业', '畜牧业', '渔业', '农、林、牧、渔专业及辅助性活动', '煤炭开采和洗选业', '石油和天然气开采业', '黑色金属矿采选业', '有色金属矿采选业', '非金属矿采选业', '开采专业及辅助性活动', '其他采矿业', '农副食品加工业', '食品制造业', '酒、饮料和精制茶制造业', '烟草制品业', '纺织业', '纺织服装、服饰业', '皮革、毛皮、羽毛及其制品和制鞋业', '木材加工和木、竹、藤、棕、草制品业', '家具制造业', '造纸和纸制品业', '印刷和记录媒介复制业', '文教、工美、体育和娱乐用品制造业', '石油、煤炭及其他燃料加工业', '化学原料和化学制品制造业', '医药制造业', '化学纤维制造业', '橡胶和塑料制品业', '非金属矿物制品业', '黑色金属冶炼和压延加工业', '有色金属冶炼和压延加工业', '金属制品业', '通用设备制造业', '专用设备制造业', '汽车制造业', '铁路、船舶、航空航天和其他运输设备制造业', '电气机械和器材制造业', '计算机、通信和其他电子设备制造业', '仪器仪表制造业', '其他制造业', '废弃资源综合利用业', '金属制品、机械和设备修理业', '电力、热力生产和供应业', '燃气生产和供应业', '水的生产和供应业', '房屋建筑业', '土木工程建筑业', '建筑安装业', '建筑装饰、装修和其他建筑业', '批发业', '零售业', '铁路运输业', '道路运输业', '水上运输业', '航空运输业', '管道运输业', '多式联运和运输代理业', '装卸搬运和仓储业', '邮政业', '住宿业', '餐饮业', '电信、广播电视和卫星传输服务', '互联网和相关服务', '软件和信息技术服务业', '货币金融服务', '资本市场服务', '保险业', '其他金融业', '房地产业', '租赁业', '商务服务业', '研究和试验发展', '专业技术服务业', '科技推广和应用服务业', '水利管理业', '生态保护和环境治理业', '公共设施管理业', '土地管理业', '居民服务业', '机动车、电子产品和日用产品修理业', '其他服务业', '教育', '卫生', '社会工作', '新闻和出版业', '广播、电视、电影和录音制作业', '文化艺术业', '体育', '娱乐业', '中国共产党机关', '国家机构', '人民政协、民主党派', '社会保障', '群众团体、社会团体和其他成员组织', '基层群众自治组织及其他组织', '国际组织']
# industry_level2 = ["农业", "林业", "畜牧业 渔业 农、林、牧、渔专业及辅助性活",
#                    "煤炭开采和洗选业", "石油和天然气开采业", "黑色金属矿采选业",
#                    "有色金属矿采选业", "非金属矿采选业", "开采专业及辅助性活动",
#                    "其他采矿业", "农副食品加工业", "食品制造业", "酒、饮料和精制茶制造业",
#                    "烟草制品业", "纺织业", "纺织服装、服饰业", "皮革、毛皮、羽毛及其制品和制鞋业",
#                    "木材加工和木、竹、藤、棕、草制品业", "家具制造业", "造纸和纸制品业",
#                     "印刷和记录媒介复制业", "文教、工美、体育和娱乐用品制造业", "石油、煤炭及其他燃料加工业",
#                    "化学原料和化学制品制造业", "医药制造业", "化学纤维制造业", "橡胶和塑料制品业",
#                    "非金属矿物制品业", "黑色金属冶炼和压延加工业", "有色金属冶炼和压延加工业",
#                    "金属制品业", "通用设备制造业", "专用设备制造业", "汽车制造业", "铁路、船舶、航空航天和其他运输设备制造业",
#                    "电气机械和器材制造业", "计算机、通信和其他电子设备制造业", "仪器仪表制造业", "其他制造业",
#                    "废弃资源综合利用业", "金属制品、机械和设备修理业", "电力、热力生产和供应业",
#                    "燃气生产和供应业", "水的生产和供应业", "房屋建筑业", "土木工程建筑业", "建筑安装业",
#                    "建筑装饰、装修和其他建筑业", "批发业", "零售业", "铁路运输业", "道路运输业"]


# industry_word = dict()
# for k, v in word_industry.items():
#     industry_word.setdefault(v, [])
#     industry_word[v].append(k)
#
# print(industry_word)
# industry_word = dict()
# from nlp_label.test_01 import label_data
# for item, vlist in label_data.items():
#     for sub, subv in vlist.items():
#         for v in subv["reason"]:
#             industry_word.setdefault(sub, [])
#             industry_word[sub].append(v)
# print(industry_word)

industry_dict = {
    '农副食品加工业': ['农副产品', '饲料行业、饲养行业'],
    '石油、煤炭及其他燃料加工业': ['石油公司'],
    '专业技术服务业': ['食品安全抽检检测'],
    '有色金属矿采选业': ['金矿', '有色金属'],
    '金属制品业': ['大型锰硅炉EPC', '金属制品业'],
    '其他金融业': ['信用卡', '信托计划'],
    '生态保护和环境治理业': ['垃圾分类设备'],
    '水的生产和供应业': ['工业园区及工业污水处理、城镇污水处理'],
    '渔业': ['养殖、饲料及饲料原料'],
    '租赁业': ["共享单车行业", "共享充电宝行业", '租金收入'],
    '广播、电视、电影和录音制作业': ['影视行业', "电影行业", "音乐行业", '影视业绩', '影视剧'],
    '管道运输业': ['天然气输送存储资产'],
  '水上运输业': ['贸易航线'],

    '木材加工和木、竹、藤、棕、草制品业': ['装置及家具公司'],
    '新闻和出版业': ['新闻出版业', '数字出版'],
'批发业': ['商品贸易', '化工品贸易业务', '甘草及其制品出口'],
     '纺织业': ['服装业'],
     '教育': ["教育行业", "教育", "在线教育", "在线教育行业", '教育研发、情智启迪和人才孵化', '教育集团', '全渠道教育与备考服务供应商', '成人在线教育机构', '小学、初中、高中的学生提供“移动互联网+科学记忆法” 的学习模式，帮助学生轻松记忆英语单词和古诗词'],
'非金属矿物制品业': ['光学领域', '特种玻璃制造行业', '非金属类的新兴工业矿物材料'],
    '建筑装饰、装修和其他建筑业': ['建筑装饰施工业务、装饰设计业务', "家居行业", "家居"],

    '橡胶和塑料制品业': ['聚氯乙烯'],
    '货币金融服务': ["银行业", '银行', '信贷',  '地方性股份制银行', '两市融资'],
'道路运输业': ["网约车行业", "出租车行业"],

'通用设备制造业': ['城市照明', '冷热事业', '冷热产业链', '冷制热事业领域、商用冷冻冷藏事业领域、空调与环境事业领域、核心零部件事业领域、工程与服务事业领', '机床生产', '厚壁滑动轴承及部套件', '车铣(磨)复合加工'],
'土木工程建筑业': ['澳门基建股龙头', '产业园建设', '绿化工程', '生活垃圾焚烧发电', '黑龙江省富锦市滨江大街及沿江景观带工程PPP项目', '动能科创园PPP项目', '萝北200兆瓦风电场EPC', '公路、桥梁工程、隧道工程、市政工程施工', '基础设施建设项目', '水资源配置工程土建施工', '邹城工业园综合管廊建设PPP项目', '综合养老服务中心', '原油战略储备库项目和中石化新气管线', '高速公路', '工程总承包业务、园林设计业务', '广州巴塞罗那国际医院项目设计施工总承包(EPC)工程'],
'烟草制品业': ['电子烟', "电子烟行业"],
'酒、饮料和精制茶制造业': ['白酒企业', '白酒',  '啤酒', '白酒行业', "白酒和威士忌", '茶饮', '茶饮行业', "新茶饮行业", "茶饮市场", '奶茶', '茶饮品牌', '饮料', '饮料行业'],
'石油和天然气开采业': ['原油', '油价', '页岩油气生产商', '石油生, 产商', '油田', '石油', "石油公司"],
'卫生': ["医疗健康行业", '妇产医院', "医疗", "医疗行业","医疗健康", '中医医疗业务'],
'资本市场服务': ['基金定期定额投资业务', '产业投资基金投资', '普惠融资担保机构', '原油和石化产品交易', '混合型证券投资基金', '基金管理', '券商', '券商', '私募股权投资'],
'电力、热力生产和供应业': ["电力行业", '国家电网项目', '150万千瓦风电项目'],
'铁路、船舶、航空航天和其他运输设备制造业': ['火箭公司', '船舶缸套', '长沙轨道交通'],
'印刷和记录媒介复制业': ['印刷业务'],
'医药制造业': ['制药业', '医药行业', '病新型药品Palynziq', '药品生产和供应', '头孢克洛胶囊', '胰岛素', '临床包装设施', '医药', '成人复发性或难治性（R/R）大B细胞淋巴瘤', '药企', '新药研发和生产的CDMO一站式综合服务商', '水利工程建设项目', '科研成果的临床转化', '药品的生产和配送', '头孢克洛胶囊'],
'专用设备制造业': ['工业自动控制行业', '轨道交通行业的专用设备制造商', '电池业务', '指纹识别模组', '摄像头模组', '多晶硅硅片、多晶硅电池片和太阳能电池板', '医疗器械钣金件、各种精密钣金结构件、充电桩、智能消费设备、通信和其他电子设', '安防行业', '医疗器械', '水利工程建设项目', '引松供水二期工程PCCP管材'],
    '其他服务业': ["中国宠物行业", '宠物行业', '宠物用品','普通清洁服务供应商'],
    '餐饮业': ["中国餐饮行业", "火锅行业", '餐饮行业', '餐饮企业', '餐饮品牌', '餐饮', '咖啡', '咖啡行业', "中国咖啡行业", '咖啡市场', '餐饮外卖', '外卖行业', '外卖业务', '火锅', '咖啡店', "咖啡品牌", "奶茶店", '食肆', '餐饮外卖业务', '餐饮业'],
    '娱乐业': ["娱乐行业", "剧本杀行业", '旅游', '旅游业', '旅游行业', '凤凰磁浮文化旅游', '太空旅游'],
    "农业": ["农业", "种植品行业",'水果', '农产品', '棉花期现', '大豆、玉米', '粮食', '棉花', '农产品供给，全力打造引领性、标杆性农业农村项目'],
    "林业": [],
    "畜牧业": [],
    "黑色金属冶炼和压延加工业": ["钢铁行业", "钢铁"],
    "邮政业": ["物流", "邮政行业", '快递行业','物流行业', "物流业",
            "国内快递行业",
            "中国快递行业",
            "快递物流公司", "中国物流行业", "即时配送行业", "快递外卖行业", '快递', '快递企业', '快递公司', '快递业务', '快递物流', '快递市场', '快递服务', "外卖平台", '快递业', '物流股'],
    "零售业": ["新零售行业", "中国零售行业", "传统零售行业", "实体零售行业",
            "生鲜电商行业", "百货行业",
            "中国生鲜电商行业", "中国电商行业",
        "汽车新零售品牌", "汽车零售行业", "连锁零售业", "奢侈品零售业态", "零售和电子商务行业", "潮流商品零售", "消费品零售",
            "跨境电商平台", "跨境电商市场", "二手垂类电商","医药新零售行业",  "母婴电商",
            '零售业', '零售商', '零售', '零售业态', '零售市场', '直播电商', "直播电商行业", '生鲜电商', '跨境电商', '电商', '电商平台', '电商业务',
            '奢侈品电商', '零售电商', '零售企业', '电商行业', '零售业务', '生鲜零售', "生鲜零售行业", '社交电商', '二手电商', '生鲜行业',
            '便利店行业', '生鲜', '菜市场', '快手电商','零售店', '零售行业', '潮流服饰零售商', '零售行业', '医药健康新零售事业', '零售商业、跨境及全球零售商业',
            '零售行业', "跨境电商行业", "社区团购行业", "直播带货行业", "本地生活行业", "超市行业", "电子商务行业", "社交电商行业",
            "零售电商行业", '便利店', "电子商务"],
    "化学原料和化学制品制造业": ["化工行业", "化工", "贵妇膏", "贵妇膏产品", "彩妆用品", "眼影品牌",'口红', '美妆', '美妆行业', "美妆市场",
                     "中国美妆行业",
                     '化妆品', '化妆品行业', '护肤品', '彩妆品牌', '美妆产品', '美妆品牌', '基础化工','高分子材料及金属成型', '化学原料和化学制品制造业', '护肤品牌', '农药', '咪鲜胺原药', '辛酰溴苯腈原药、氟环唑原药', '农药原药、中间体及制剂产品', '氟精细化学品', '高端煤基新材料和化学品制造业', '电石', 'SCR脱硝催化剂'],
    "仪器仪表制造业": ["钟表业",'仪器仪表制造行业', '5G商用仪器仪表', '智能电表', '小口径智能水表'],
    "保险业": ["保险行业", "保险领域",'保费', "保险", '新型全球级科考船“大洋号”一揽子保险', '保险公司'],
    "食品制造业": ['零食行业', "调味品行业",
        "休闲零食行业",
        "小零食", "食品", "烤鸭烤鹅烤鸡", "生鲜食品", "五芳斋粽子", "零食产品", "坚果零食行业", "生鲜食品", "冷链食品", '零食', '食品饮料', "食品饮料行业", '燕窝', '冰淇淋', '螺蛳粉', '食品行业', '食品加工', '婴幼儿奶粉', '雪糕', '乳业巨头', '奶粉商', '牛肉食品'],
    "互联网和相关服务": ["互联网行业", "移动互联网行业", "云计算行业",
                 "互联网", "中国互联网行业", "智能运维平台", "移动社交平台", "在线教育平台", '云计算', '短视频行业', '叙事和游戏设计', '泛社交泛娱乐平台', '中国制造网电子商务平台', '云计算产业化项目', '人工智能高性能计算资源池', '移动阅读分发平台', '信用卡', '运营物联网专用网络', '电信业务外包、移动终端销售；驻地网投资、建设与运营；智慧社区O2O平台业务', '互联网服务', '二手交易平台', "直播行业"],

    "计算机、通信和其他电子设备制造业": ["半导体行业", "半导体产业", "智能手机行业", "芯片行业","机器人行业", "物联网",
                         "锂电池、半导体","光伏产品", "人工智能芯片科技", '半导体', '电子产品', '手机行业', '手机',
                         '机器人', '扫地机器人', '智能电话机器人', '网络设施建设', 'NAND闪存芯片制造商', '智能音频 SoC 芯片的研发、设计与销售', '智能手机',
                         '半导体供应商', '车载AR显示产品及解决方案提供商', '双路服务器NF5280M5', '四路服务器NF8480M5', '半导体芯片设计',
                         '通信站点', '物联网芯片设计', '智能音箱', '特种功能材料', '4G网络建设项目', '通信工程专业监理服务', '电子设备', '微芯片设计',
                         '智能制造行业', '35kV至500kV钢芯铝绞线、35kV至500kV铝包钢芯铝绞线', '量子通信', '汽车半导体产业', 'NFV智能网SCP AS设备',
                         '通讯系统设备、消费电子部件配件', '矿机制造商', 'GPU市场', '自动化智能仓储配送系统', 'SMT装备制造', '12英寸CIS集成电路',
                         '比特币矿机', '光通信集成电路行业', '面板行业', '电力电子产品'],
    "体育": ["健身俱乐部", "健身行业", "体育"],
    "文教、工美、体育和娱乐用品制造业": ["珠宝品牌", "比特币矿机珠宝", "珠宝行业"],
    "纺织服装、服饰业": ["服装企业",'内衣品牌', '服装', '羽绒服', '服装行业', "中国服装行业", '服装品牌', '服饰品牌', '服饰行业', '服饰', "内衣行业"],
    "电气机械和器材制造业": ["家电领域",'光伏行业', '家电行业', "小家电行业", "中国家电行业", "电视行业", "家电", '光伏', '泛亚工程机电设备', '数字通信用水平对绞电缆', '光伏',
                   '驱动器及控制器', '光伏', '10kV交流电力电缆（阻燃型）、低压电线配网设备', '储能和输电解决方案', '自动化制造电池'],
    "文化艺术业": ["儿童文学"],

    "商务服务业": ["广告行业",
                "汽车广告行业",
              "医药类广告",'商户与企业服务', '现代商贸服务型企业', '传媒业务', '列车媒体及户外广告', '广告发布代理、制作公司', 'LED屏幕广告', 'LED显示屏主营业务，非核心广告业务','企业设备管理', '客户从事品牌特许产品经营、品牌营销、渠道拓展、电子商务'],
    "软件和信息技术服务业": ["软件行业", "软件服务行业", "视频行业", "SaaS行业", '人工智能','国内智能交通和交通信息化', '通信技术服务业', '虚拟现实提供商',  '5G', '物联网无线通信', '多媒体通信行业', '国内数据中心基础设施设备', '云托管+捷停车', '政府信息化整体解决方案提供商', '智能交通、智慧医疗、网络安全、其他系统集成', '交通软件提供商', '视频会议平台', '数据库软件服务', '信息技术', '通信技术服务业', 'APM应用性能管理', '视觉综合解决方案及产品', 'IT 部门提供企业解决方案', '人工智能医疗科技企业'],
    "房地产业": ["地产行业", "房地产行业",'房地产', '房企', "地产", '土地布局', '房地产', '经纪业务、新房业务、资产管理', '旭辉广场、旭辉Mall、旭辉U天地', '物业'],
    "住宿业": ["酒店行业", "酒店"],
    "居民服务业": ["医美服务行业", "医美行业", "家庭劳务服务",'美容院、健身会所、养生会所、产后恢复中心提供优质的产品'],
    "汽车制造业": ["汽车制造业", "新能源汽车行业", "汽车产业", '汽车行业', "汽车", '新能源汽车', '电动汽车', '电动车','汽车制造商', '捷豹路虎', '奥迪', '宝马', '中低速、新能源、场地车', '汽车继电器', '新造车领域'],
    "家具制造业": ["家具行业"],
}

for k, v in industry_dict.items():
    if k not in industry_list:
        print(k)
        break

# import pandas as pd
# df = pd.read_csv("D:\\xxxx\\t_industry.csv")
# industry_list = []
# for i, row in df.iterrows():
#     industry_list.append(row["industry_name"])
# print(industry_list)



def func(input_x):
    for p, pv in industry_dict.items():
        if input_x in pv:
            return True
    return False

with open("D:\\xxxx\\industry_span.json", "r") as f:
    data = f.read()

data_json = json.loads(data)
data__list = [(k, v) for k, v in data_json.items()]
data__list.sort(key=lambda x: x[1], reverse=True)
iv = 0
for k, v in data__list:
    if func(k):
        continue
    iv += 1
    print(k, v)

print(iv)