#!/usr/bin/env python
# -*- coding:utf-8 -*-
"""
    @Time : 2022/5/30 13:28
    @Author  : jack.li
    @Site    : 
    @File    : product_kg.py

"""
import json
data_path = "D:\\xxxx\\product_label.json"
product_keyword_base = {
    "化妆品": ["*美妆品牌", "*彩妆品牌", "*化妆品牌", "*化妆品品牌", "*韩妆品牌", "*国妆品牌", "*药妆品牌", "*彩妆集合品牌", "*彩妆行业品牌",
            "*美妆集合店品牌", "*化妆品新品牌", "*美妆新品牌", "*美妆行业品牌"],
    "面膜": ["面膜品牌"],
    "餐饮服务": ["*餐饮品牌", "*茶饮品牌", "*火锅品牌", "*餐饮连锁品牌", "*茶饮连锁品牌", "*麻辣烫品牌", "*连锁餐饮品牌",
                "*兰州牛肉面品牌", "*火锅连锁品牌",  "*兰州拉面品牌", "*湖南米粉品牌", "*中餐连锁品牌",
                "*互联网餐饮品牌", "*兰州拉面连锁品牌", "*小吃品牌", "*烧烤品牌"],
    "个人卫生护理用品": ["*个护品牌", "男士护理品牌", "个人护理品牌"],
    "干果类": ["*坚果品牌"],
    "电视机": ["*电视品牌"],
    "健身房": ["*健身品牌"],
    "调味料": ["*复合调味料品牌", "*调味品品牌"],
    "公共自行车租赁": ["*共享单车品牌"],
    "服装": ["*服装品牌", "*汉服品牌", "*时装品牌", "*汉服国风品牌", "汉服古装品牌"],
    "服装、服饰与奢侈品": ["*服饰品牌"],
    "咖啡饮料": ["*咖啡品牌"],
    "眼镜": ["*眼镜品牌"],
    "咖啡厅": ["*连锁咖啡品牌", "*咖啡连锁品牌"],
    "护肤品": ["*护肤品牌", "*护肤品品牌", "*护肤品类TOP10品牌"],
    "茶饮料": ["*茶饮品牌", "*奶茶品牌", "*柠檬茶品牌"],
    "手机": ["*手机品牌", "Redmi品牌"],
    "互联网软件与服务": ["*互联网品牌"],
    "女装": ["*女装品牌"],
    "男装": ["*男装品牌", "男装品类TOP10品牌"],
    "内衣": ["*内衣品牌"],
    "家纺": ["*家纺品牌"],
    "羽绒服": ["*羽绒服品牌", "*羽绒品牌"],
    "电商平台提供商": ["*电商品牌", "*社区团购品牌", "*社区生鲜品牌"],
    "食品": ["食品品牌", "美食品牌", "食品行业品牌", "*植物肉品牌", "*鲜炖燕窝品牌",  "*代餐品牌", "*燕窝品牌", "*生鲜品牌", "*卤味品牌",
           "*健康食品品牌", "*儿童食品品牌", "*功能性食品品牌", "*螺蛳粉品牌"],
    "其他方便食品": ["*预制菜品牌"],
    "家用电器": ["家电品牌", "*大家电品牌", "*传统家电品牌", "*国产家电品牌", "*智能家电品牌", "*互联网家电品牌",
             "高端家电品牌", "法国家电品牌", "网红家电品牌", "苏宁双11家电品牌", "头部家电品牌", "德国奢侈品家电品牌",
             "京东家电品牌", "高端德国家电品牌", "河南某家电品牌", "新西兰家电品牌", "知名家电品牌", "本土家电品牌",
             "物联网家电品牌", "核心家电品牌", "西门子家电品牌", "大宗家电品牌", "主流家电品牌", "新老家电品牌",
             "互联家电品牌", "日本家电品牌", "家居微家电品牌", "德国家电品牌", "健康类家电品牌", "国美在售家电品牌",
             "综合家电品牌", "生活家电品牌", "家电头部品牌", "国民级家电品牌", "电器品牌", "家用电器品牌"
             ],
    "糖果": ["*巧克力品牌", "*糖果品牌"],
    "汽车": ["*汽车品牌", "*豪车品牌", "超级跑车品牌"],
    "童装": ["*童装品牌", "童装DTC品牌", "*童装行业品牌"],
    "便利店": ["*便利店品牌"],
    "户外休闲用品": ["*户外品牌", "*户外运动品牌"],
    "长租公寓经营": ["*长租公寓品牌"],
    "玩具": ["*玩具品牌"],
    "牙刷": ["*电动牙刷品牌"],
    "珠宝首饰": ["*珠宝品牌"],
    "快递物流": ["*快递品牌"],
    "电子烟": ["*电子烟品牌"],
    "白酒": ["*白酒品牌", "*白酒头部品牌"],
    "啤酒": ["*啤酒品牌"],
    "酒精饮料": ["*低度酒品牌", "*酒类品牌", "*酒水品牌", "*洋酒品牌", "酒品牌"],
    "其他酒精饮料": ["*果酒品牌", "*青梅酒品牌", "*水果酒品牌"],
    "饮料": ["*饮料品牌", "*饮品品牌", "*气泡水品牌"],
    "宠物服务": ["*宠物品牌"],
    "母婴护理服务": ["*母婴品牌"],
    "口腔护理服务": ["*口腔护理品牌"],
    "小家电": ["*小家电品牌"],
    "食用油": ["*食用油品牌"],
    "烘焙糕点类": ["*烘焙品牌"],
    "快餐店": ["*快餐品牌", "*西式快餐加盟连锁品牌"],
    "奶粉": ["*奶粉品牌"],
    "其他消费电子产品": ["*充电宝品牌"],
    "租赁服务": ["*共享充电宝品牌"],
    "宠物用品": ["*宠物用品品牌"],
    "宠物食品": ["*宠物食品品牌"],
    "休闲食品": ["*休闲食品品牌", "*零食品牌", "*零食老品牌", "零食品类TOP10品牌"],
    "婴儿食品": ["*婴童食品品牌", "专业婴幼儿辅食品牌"],
    "植物蛋白饮料": ["植物奶品牌", "燕麦奶品牌"],
    "香水": ["*香水品牌"],
    "农产品": ["*农产品品牌"],
    "酒店及度假村": ["*酒店品牌"],
    "冰淇淋": [ "*冰淇淋品牌"],
    "家具": ["*家具品牌"],
    "床垫": ["*床垫品牌"],
    "运动鞋": ["*运动鞋品牌"],
    "方便食品": ["*速食品牌", "方便食品品牌", "速食面/粉类品牌"],
    "方便面": ["*方便面品牌"],
    "其他乳制品": ["*酸奶品牌", "*雪糕品牌"],
    "运动服装": ["*运动服品牌"],
    "保健食品": ["*保健品品牌"],
    "其他物流服务": ["*外卖品牌"],
    "纺织品、服装与奢侈品": ["*奢侈品牌", "*奢侈品品牌"],
    "花卉": ["*鲜花品牌"],
    "葡萄酒": ["*葡萄酒品牌", "*红酒品牌"],
    "电脑硬件": ["*智能硬件品牌"],
    "出租车服务": ["*网约车品牌"],
    "乳制品": ["*乳业品牌", "*乳制品品牌"],
    "隐形眼镜": ["*美瞳品牌", "*彩瞳品牌"],
    "鞋类": ["*鞋履品牌"],
    "牙膏": ["*牙膏品牌"],
    "电动摩托车": ["电动车品牌"],
    "化妆品零售": ["*化妆品零售品牌"],
    "中药": ["*中药品牌"],
    # "糖果": ["成人糖果品牌"]
}

# product_keyword = {
#     "化妆品": ["美妆品牌", "彩妆品牌", "化妆品牌","化妆品品牌", "韩妆品牌", "国妆品牌", "药妆品牌","彩妆集合品牌",
#             "彩妆行业品牌",
#             "国货美妆品牌", "韩系美妆品牌",  "国货彩妆品牌", "国产美妆品牌", "高端美妆品牌",
#             "国产彩妆品牌", "美妆集合店品牌", "国际美妆品牌",  "韩国美妆品牌", "传统美妆品牌", "中国美妆品牌",
#             "本土美妆品牌",  "网红美妆品牌", "中国化妆品品牌", "个人美妆品牌", "国货化妆品品牌", "新国货美妆品牌",
#             "国货少女彩妆品牌", "高端化妆品品牌", "国产化妆品牌", "新兴美妆品牌", "头部美妆品牌", "互联网美妆品牌", "男士彩妆品牌",
#             "日本美妆品牌",
#             "百雀羚品牌"],
#     "餐饮服务": ["餐饮品牌", "火锅品牌", "餐饮连锁品牌", "茶饮连锁品牌", "麻辣烫品牌"
#              "连锁餐饮品牌", "传统餐饮品牌",  "连锁茶饮品牌",
#              "新中式茶饮品牌", "网红餐饮品牌", "中式餐饮连锁品牌",
#              "兰州牛肉面品牌", "火锅连锁品牌", "毛肚火锅品牌", "牛肉火锅品牌", "兰州拉面品牌", "湖南米粉品牌", "中餐连锁品牌",
#              "新餐饮品牌", "互联网餐饮品牌", "兰州拉面连锁品牌", "中国餐饮品牌", "新式餐饮品牌", "中式餐饮品牌"],
#     "干果类": ["坚果品牌"],
#     "电视机": ["电视品牌"],
#     "健身房": ["健身品牌"],
#     "调味料": ["复合调味料品牌"],
#     "公共自行车租赁": ["共享单车品牌"],
#     "服装": ["服装品牌", "汉服品牌", "时装品牌", "中国服装品牌", "传统服装品牌", "汉服国风品牌", "运动服装品牌", "国内服装品牌",
#            "休闲服装品牌"],
#     "服装、服饰与奢侈品": ["服饰品牌", "运动服饰品牌", "国内服饰品牌", "传统服饰品牌", "潮流服饰品牌", "无性别服饰品牌"],
#     "咖啡饮料": ["咖啡品牌", "精品咖啡品牌", "互联网咖啡品牌", "加拿大国民咖啡品牌", "速溶咖啡品牌", "新咖啡品牌", "即饮咖啡品牌"],
#     "咖啡厅": ["连锁咖啡品牌", "咖啡连锁品牌"],
#     "护肤品": ["护肤品牌", "护肤品品牌", "美妆护肤品牌", "国货护肤品牌", "高端护肤品牌", "国产护肤品牌", "男士护肤品牌", "功效护肤品牌",
#             "功能性护肤品牌", "美国护肤品牌", "自然护肤品牌", "功能性护肤品品牌", "男性护肤品牌"],
#     "茶饮料": ["茶饮品牌", "新式茶饮品牌", "奶茶品牌", "新茶饮品牌", "网红茶饮品牌", "柠檬茶品牌", "头部茶饮品牌"],
#     "手机": ["手机品牌", "智能手机品牌", "国产手机品牌", "中国手机品牌", "互联网手机品牌"],
#     "互联网软件与服务": ["互联网品牌"],
#     "女装": ["女装品牌", "大码女装品牌", "高端女装品牌", "轻奢女装品牌"],
#     "男装": ["男装品牌", "国内男装品牌"],
#     "内衣": ["内衣品牌", "传统内衣品牌", "老牌内衣品牌"],
#     "家纺": ["家纺品牌"],
#     "羽绒服": ["羽绒服品牌", "奢侈羽绒品牌", "奢侈羽绒服品牌", "国产羽绒服品牌"],
#     "电商平台提供商": ["电商品牌", "社区团购品牌", "社区生鲜品牌"],
#     "食品": ["食品品牌", "食品行业品牌", "植物肉品牌", "鲜炖燕窝品牌", "健康食品品牌",  "代餐品牌", "儿童食品品牌", "功能性食品品牌",
#            "纯互联网食品品牌", "燕窝品牌", "生鲜品牌", "卤味品牌"],
#     "家用电器": ["家电品牌", "传统家电品牌", "大家电品牌"],
#     "糖果": ["巧克力品牌"],
#     "汽车": ["汽车品牌", "新能源汽车品牌", "电动汽车品牌", "豪车品牌", "豪华汽车品牌"],
#     "童装": ["童装品牌", "专业童装品牌", "新童装品牌"],
#     "便利店": ["便利店品牌", "连锁便利店品牌", "本土便利店品牌", "区域便利店品牌", "日资便利店品牌", "北京便利店品牌"],
#     "户外休闲用品": ["户外品牌", "户外运动品牌"],
#     "长租公寓经营": ["长租公寓品牌"],
#     "玩具": ["玩具品牌"],
#     "珠宝首饰": ["珠宝品牌", "美国奢侈珠宝品牌", "美国珠宝品牌", "丹麦珠宝品牌", "奢侈珠宝品牌"],
#     "快递物流": ["快递品牌"],
#     "电子烟": ["电子烟品牌"],
#     "白酒": ["白酒品牌", "传统白酒品牌", "白酒头部品牌"],
#     "啤酒": ["精酿啤酒品牌", "啤酒品牌"],
#     "酒精饮料": ["低度酒品牌", "酒类品牌", "酒水品牌", "洋酒品牌", "酒品牌"],
#     "其他酒精饮料": ["果酒品牌", "青梅酒品牌", "水果酒品牌", "红酒品牌"],
#     "饮料": ["饮料品牌", "饮品品牌", "气泡水品牌"],
#     "宠物服务": ["宠物品牌"],
#     "母婴护理服务": ["母婴品牌"],
#     "口腔护理服务": ["口腔护理品牌"],
#     "小家电": ["小家电品牌"],
#     "食用油": ["食用油品牌"],
#     "烘焙糕点类": ["烘焙品牌", "中式烘焙品牌", "新中式烘焙品牌"],
#     "快餐店": ["快餐品牌", "中式快餐品牌", "西式快餐加盟连锁品牌", "连锁快餐品牌"],
#     "奶粉": ["奶粉品牌", "国产奶粉品牌"],
#     "其他消费电子产品": ["充电宝品牌"],
#     "租赁服务": ["共享充电宝品牌"],
#     "宠物用品": ["宠物用品品牌"],
#     "宠物食品": ["宠物食品品牌"],
#     "休闲食品": ["休闲食品品牌", "零食品牌", "休闲零食品牌", "儿童零食品牌", "健康零食品牌", "网红零食品牌", "互联网零食品牌", "传统零食品牌"],
#     "婴儿食品": ["婴童食品品牌"],
#     "香水": ["香水品牌"],
#     "农产品": ["农产品品牌"],
#     "酒店及度假村": ["酒店品牌", "连锁酒店品牌"],
#     "冰淇淋": [ "冰淇淋品牌"],
#     "家具": ["家具品牌"],
#     "床垫": ["床垫品牌"],
#     "运动鞋": ["运动鞋品牌"],
#     "方便食品": ["速食品牌", "方便速食品牌", "方便食品品牌"],
#     "方便面": ["方便面品牌"],
#     "其他乳制品": ["酸奶品牌", "雪糕品牌", "网红雪糕品牌", "中式雪糕品牌"],
#     "运动服装": ["运动服品牌"],
#     "保健食品": ["保健品品牌"],
#     "其他物流服务": ["外卖品牌"],
#     "纺织品、服装与奢侈品": ["奢侈品牌", "奢侈品品牌", "意大利奢侈品牌", "法国奢侈品牌", "英国奢侈品牌", "头部奢侈品牌", "传统奢侈品牌",
#                    "高端奢侈品牌", "美国奢侈品牌"],
#     "花卉": ["鲜花品牌"],
#     "葡萄酒": ["葡萄酒品牌"],
#     "电脑硬件": ["智能硬件品牌"],
#     "出租车服务": ["网约车品牌"],
#     "乳制品": ["乳业品牌"],
#     "隐形眼镜": ["美瞳品牌"]
# }
with open(data_path, "r") as f:
    data = f.read()
data_dict = json.loads(data)
data_list = [(k, v) for k, v in data_dict.items()]
data_list.sort(key=lambda x: x[1], reverse=True)


def not_valid(input_str):
    if len(input_str) < 3:
        return True
    if len(input_str) > 14:
        return True
    if "、" in input_str:
        return True
    return False
def func(input_x):

    for p, pv in product_keyword.items():
        if input_x in pv or input_x[-4:] in pv:
            return True

    return False
def func_v2(input_x):

    for p, pv in product_keyword_base.items():
        for pvi in pv:
            if pvi[0] == "*":
                pv_len = len(pvi)-1
                if input_x[-pv_len:] == pvi[1:]:
                    return True
            else:
                if input_x == pvi:
                    return True
    return False
iv = 0
for k, v in data_list:
    if not_valid(k):
        # print(k, "is not valid")
        continue
    if func_v2(k):
        continue
    iv += 1
    print(k, v, len(k))

print(len(data_list), iv)