#!/usr/bin/env python
# -*- coding:utf-8 -*-
"""
    @Time : 2022/5/24 23:33
    @Author  : jack.li
    @Site    : 
    @File    : invest_event_res.py

"""
# import datetime
import pandas as pd
from nlp_tf2_implement.ner.evaluation import eval_metrix
#
df = pd.read_csv("D:\\xxxx\\invest_event_v3.csv")
#
# d_path = "D:\\xxxx\\invest_new.json"
# # df['日期']=data["日期"].values.astype('datetime64')  #如果已为日期格式则此步骤可省略
# df["date"] = df["create_date"].values.astype('datetime64')
# s_date = datetime.datetime.strptime('2022-05-14', '%Y-%m-%d').date()
# # row["data"]
# name_dict = dict()
# df = df[(df.date>pd.Timestamp(s_date))]
# for idx, row in df.iterrows():
#     if not isinstance(row["investee"], float):
#         for name in row["investee"].split("、"):
#             if len(name) < 2:
#                 continue
#             name_dict.setdefault(name, 0)
#             name_dict[name] += 1
#     if not isinstance(row["investor"], float):
#         for name in row["investor"].split("、"):
#             if len(name) < 2:
#                 continue
#             name_dict.setdefault(name, 0)
#             name_dict[name] += 1
# import json
# with open(d_path, "w") as f:
#     f.write(json.dumps(name_dict))
    # print(row["investee"])

event_label = {
    "0007ee87e3a20db92a576d5236a6b849": [
        {
            "投资方": ["经纬中国", "盛美启明"],
            "被投资方": ["新素食"],
            "融资金额": ["数千万人民币"],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": ["近日"],

            "领投方": ["经纬中国"],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }
    ],
    "0009557398ef4800e712b090994104be": [
        {
            "投资方": ["上海银行"],
            "被投资方": ["上海博泰"],
            "融资金额": ["15亿元人民币"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["昨日"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        },
        {
            "投资方": ["苏宁控股集团(Suning)"],
            "被投资方": ["博泰"],
            "融资金额": ["数亿元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["当天"],

            "领投方": ["苏宁控股集团(Suning)"],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }
    ],
    "000bdf48c8e2f28f25035fe4717fedf0": [
        {
            "投资方": ["YOKIA"],
            "被投资方": ["启荣创投", "青锐创投"],
            "融资金额": ["数千万元"],
            "披露时间": ["6月2日"],
            "融资轮次": ["天使"],
            "事件时间": ["近日"],

            "领投方": ["启荣创投"],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        },
    ],
    "000c48893b34aecdbfd53d68f2f53a33": [
        {
            "投资方": ["Knotel"],
            "被投资方": ["科威特主权财富基金的投资部门Wafra", "森信托株式会社（Mori Trust）", "伊藤忠商事株式会社（Itochu）", "摩科瑞（Mercuria)"],
            "融资金额": ["4亿美元"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": ["近日"],

            "领投方": ["科威特主权财富基金的投资部门Wafra"],
            "估值": ["10亿美元"],
            "财务顾问": [],
            "trigger": ["融资"],
        },
    ],
    "000dafce2aed6dc29392ae586392a38e": [
        {
            "投资方": ["药明康德", "久友资本", "复容投资"],
            "被投资方": ["大橡科技"],
            "融资金额": ["千万元"],
            "披露时间": [],
            "融资轮次": ["天使轮"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "000dc4aee4479803a9fd93454d6b80d2": [
        {
            "投资方": ["五源资本", "红杉中国", "挑战者资本"],
            "被投资方": ["伙伴云"],
            "融资金额": ["1700万美元"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00103dd7b9fc3dfcd8c0c196232b255f": [{
            "投资方": ["金浦健康基金"],
            "被投资方": ["归领医疗"],
            "融资金额": ["数千万元"],
            "披露时间": ["5月21日"],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }],
    "001261b33a0c4c197973cf66c296161d": [
        {
            "投资方": ["Altimeter Capital", "Google Ventures", "Benchmark Capital"],
            "被投资方": ["Cockroach Labs"],
            "融资金额": ["5500万美元"],
            "披露时间": ["8月7日"],
            "融资轮次": ["C"],
            "事件时间": [],
            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }
    ],
    "0012d57b421a336b9cbfb0686edc91f4": [
        {
            "投资方": ["Y Combinator"],
            "被投资方": ["Ramen VR"],
            "融资金额": [],
            "披露时间": ["8月26日"],
            "融资轮次": ["天使"],
            "事件时间": [],
            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "001497526dfe8ab81d51f74e41b0e161": [
        {
            "投资方": ["中国互联网投资基金", "知名产业资本", "多家一线投资机构"],
            "被投资方": ["闪捷信息"],
            "融资金额": ["6亿元人民币"],
            "披露时间": ["12月20日"],
            "融资轮次": ["B"],
            "事件时间": [],
            "领投方": ["中国互联网投资基金", "知名产业资本"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0014c5c04a138a9955e2848deb3de11e": [],
    "00167c0bf02f8bb4034392992b80fc5a": [],
    "001697ba18e6cc223920c0c03a6552e3": [{
            "投资方": ["GHIF", "TT Capital Partners", "BrightEdg"],
            "被投资方": ["Navigating Cancer"],
            "融资金额": ["2600万美元"],
            "披露时间": ["9月29日"],
            "融资轮次": ["D"],
            "事件时间": [],

            "领投方": ["GHIF", "TT Capital Partners"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }],
    "00183acd4539a1a2a68ec90fde73d4fb": [
        {
            "投资方": [],
            "被投资方": ["中海"],
            "融资金额": ["60亿元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["今年8月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["公司债"],
        },
        {
            "投资方": [],
            "被投资方": ["保利"],
            "融资金额": ["100亿元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["近期"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["公司债"],
        }
    ],
    "0019301cdec2ebb379ecb52713934697": [
        {
            "投资方": [],
            "被投资方": ["StemoniX"],
            "融资金额": ["1440万美元"],
            "披露时间": [],
            "融资轮次": ["B轮"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Ikonopedia, Inc."],
            "融资金额": ["200万美元"],
            "披露时间": [],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Maze Therapeutics"],
            "融资金额": ["1.91亿美元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }],
    "001a5db822f676f34395067e26f1bcae": [
        {
            "投资方": ["头头是道"],
            "被投资方": ["熊猫不走"],
            "融资金额": ["数千万元"],
            "披露时间": ["11月7日"],
            "融资轮次": ["Pre-A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["维妥科技"],
            "融资金额": ["1000万人民币"],
            "披露时间": ["11月7日"],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["大鹅文化"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A+"],
            "事件时间": [],
            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "001c8566569d9c5b6ee49396dadb0514": [],
    "002165419c47a3754c2a1e3f514e8fe6": [
        {
            "投资方": ["新浪微博"],
            "被投资方": ["洋码头"],
            "融资金额": ["数亿元"],
            "披露时间": ["1月13日"],
            "融资轮次": ["D"],
            "事件时间": [],

            "领投方": ["新浪微博"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00233c76e1e97f81360dcbec69af5c99": [
        {
            "投资方": ["爱倩海投资", "汇智投资"],
            "被投资方": ["优车库"],
            "融资金额": ["5000万元"],
            "披露时间": [],
            "融资轮次": ["D"],
            "事件时间": [],

            "领投方": ["爱倩海投资"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": ["不惑创投"],
            "被投资方": ["优车库"],
            "融资金额": ["2000万元"],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": ["2018年3月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "002717f4675c0161659a177b53bd1a86": [
        {
            "投资方": ["启明创投", "元生创投", "建发新兴投资", "远洋资本"],
            "被投资方": ["北京豪思生物科技有限公司"],
            "融资金额": ["2亿元"],
            "披露时间": ["6月10日"],
            "融资轮次": ["B+"],
            "事件时间": [],

            "领投方": ["启明创投"],
            "估值": [],
            "财务顾问": ["易凯资本"],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["北京豪思生物科技有限公司"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": ["2020年12月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],

    "0027e684c50d1d7b2c91ee54c3bfc617": [
        {
            "投资方": ["NOVA Ecofund"],
            "被投资方": ["BLUCON"],
            "融资金额": [],
            "披露时间": ["4月21日"],
            "融资轮次": [],
            "事件时间": [],
            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "002c91f4bbb8e704e017b9978bddebc8": [
        {
            "投资方": ["软银愿景基金二期", "高盛", "春华资本", "富达国际", "经纬中国", "红杉资本中国基金", "元生资本"],
            "被投资方": ["北森"],
            "融资金额": ["2.6亿美元"],
            "披露时间": [],
            "融资轮次": ["F"],
            "事件时间": ["5月11日"],

            "领投方": [],
            "估值": [],
            "财务顾问": ["华兴资本"],
            "trigger": ["融资"],
        }
    ],
    "002cb08fba71cccfaa4d2907ad0dc38d": [
        {
            "投资方": ["中国光大银行股份有限公司香港分行"],
            "被投资方": ["保利置业"],
            "融资金额": ["10亿港元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["8月25日"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "002e1aaf97106f4fbf0caa7578b2d837": [
        {
            "投资方": ["富森美"],
            "被投资方": ["九洲防控"],
            "融资金额": ["3000万人民币"],
            "披露时间": ["12月25日"],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00301df5010a624c7ae28ad485886503": [
        {
            "投资方": ["上汽投资-尚颀资本", "上汽加州资本", "北京车联网产业发展基金投资"],
            "被投资方": ["天瞳威视"],
            "融资金额": ["1亿人民币"],
            "披露时间": ["9月18日"],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }
    ],
    "00309d7b771734aa381baea10c7ee6c1": [],
    "0030cdd54baeaa289a5651158b3bfc3c": [
        {
            "投资方": ["西交一八九六资本", "北京创势资本"],
            "被投资方": ["咏圣达"],
            "融资金额": ["数百万元人民币"],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00312acc64a6383d79e6c3aab44d855c": [
        {
            "投资方": ["中信产业基金"],
            "被投资方": ["中泉信"],
            "融资金额": [],
            "披露时间": ["11月27日"],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0034176e8d8dafc34c69120d515bdf57": [
        {
            "投资方": ["启赋资本", "开金产业投资基金", "维京投资"],
            "被投资方": ["小斑马科技"],
            "融资金额": ["3700万元"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": ["启赋资本"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "003509f5a34ea712724ca7f53234ace2": [
        {
            "投资方": [],
            "被投资方": ["宸帆"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["B+"],
            "事件时间": ["今年4月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0035e33967f094756231b4e765d2bea1": [
        {
            "投资方": ["Collaborative Fund", "Advance Venture Partners", "Notation Capital"],
            "被投资方": ["Sawyer"],
            "融资金额": ["1100万美元"],
            "披露时间": ["5月17日"],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": ["Advance Venture Partners"],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }
    ],
    "00394f729face0521b0a4aa4f0e7c771": [
        {
            "投资方": ["特一药业"],
            "被投资方": ["小苹果儿科医生"],
            "融资金额": ["1亿人民币"],
            "披露时间": ["11月1日"],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "003a9218e16e1932201a17eccf7bae65": [
        {
            "投资方": ["Heliconia Capital Management"],
            "被投资方": ["Secretlab"],
            "融资金额": ["亿元及以上"],
            "披露时间": ["8月15日"],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "003c2637f103a5b9e0ce474ee0e3b7e4": [
        {
            "投资方": ["米哈游miHoYo", "深圳厚德前海基金", "火山石资本"],
            "被投资方": ["艾漫动漫"],
            "融资金额": ["数千万人民币"],
            "披露时间": ["7月5日"],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "003cec056862ef4f5ee9177b04e37346": [
        {
            "投资方": ["梅花创投", "前海母基金", "野草创投", "东方富海"],
            "被投资方": ["锐思华创"],
            "融资金额": ["数千万元"],
            "披露时间": ["6月25日"],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": ["梅花创投"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "003dacb3945d37235f6bc9a3a449bc56": [
        {
            "投资方": ["三一创新", "国投创合", "海松资本", "中南弘远（中南创投基金）", "光量资本", "深创投", "lakecapital泽悦资本"],
            "被投资方": ["挚盟医药"],
            "融资金额": ["2.3亿人民币"],
            "披露时间": ["11月6日"],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": ["三一创新"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00404d6f826d8e703dcc6b4e4c825130": [
        {
            "投资方": ["东合创投", "奋毅资本"],
            "被投资方": ["畅的新材料"],
            "融资金额": ["数千万元人民币"],
            "披露时间": ["1月12日"],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": ["东合创投"],
            "估值": [],
            "财务顾问": ["奋毅资本"],
            "trigger": ["融资"],
        }
    ],
    "00405274b76af00250ce2c98645c26bc": [],
    "004217557f500f6a7db3a89d13e1b26e": [
        {
            "投资方": [],
            "被投资方": ["越秀金控"],
            "融资金额": ["6亿元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["6月19日"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["超短期融资券"],
        }
    ],
    "0042746acf571d2bb65e9f6eb5dd70d2": [
        {
            "投资方": ["经纬创投", "五源资本", "雅亿资本"],
            "被投资方": ["中科国生"],
            "融资金额": ["数千万元"],
            "披露时间": ["11月17日"],
            "融资轮次": ["天使"],
            "事件时间": ["近日"],

            "领投方": ["经纬创投", "五源资本"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0043738d05ce1dfb4a12460b709c660d": [],
    "00485140bafdd2a25173d5f1ee98c528": [
        {
            "投资方": ["住友商事亚洲资本"],
            "被投资方": ["E-PORTS"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["B2"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["战略投资"],
        },
        {
            "投资方": ["金沙江联合资本"],
            "被投资方": ["E-PORTS"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["B1"],
            "事件时间": ["一个月前"],

            "领投方": ["金沙江联合资本"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0048ce59b86aef8c889359661f05dc57": [
        {
            "投资方": ["蓝驰创投"],
            "被投资方": ["三体云动"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["投资"],
        }
    ],
    "004b7f9632f881f3fa83e7bbc149f177": [
    ],
    "004bac9536b571eb53266d7a9491b398": [
        {
            "投资方": [],
            "被投资方": ["网易云音乐"],
            "融资金额": ["7.5亿元"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": ["2017年4月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": ["泛大西洋投资集团", "博裕资本", "百度"],
            "被投资方": ["网易云音乐"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["2018年10月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        },
        {
            "投资方": ["阿里巴巴", "云锋基金"],
            "被投资方": ["网易云音乐"],
            "融资金额": ["7亿美元"],
            "披露时间": [],
            "融资轮次": ["B2"],
            "事件时间": ["2019年9月"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00516755c7e93cf8205352ca834dbd56": [
        {
            "投资方": [],
            "被投资方": ["HappiCare"],
            "融资金额": ["数百万人民币"],
            "披露时间": [],
            "融资轮次": ["种子"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["小创科技"],
            "融资金额": ["1000万人民币"],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Magic Leap"],
            "融资金额": ["5亿美元"],
            "披露时间": [],
            "融资轮次": ["E"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["金匙基因"],
            "融资金额": ["1亿人民币"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["语祯物联"],
            "融资金额": ["数千万人民币"],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Nuvia"],
            "融资金额": ["5300万美元"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Punchh"],
            "融资金额": ["4000万美元"],
            "披露时间": [],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Advanced Systems Concepts"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["战略投资"],
        },
        {
            "投资方": [],
            "被投资方": ["Eigen Technologies"],
            "融资金额": ["3700万美元"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["优版权"],
            "融资金额": ["1000万人民币"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["游帮科技"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["战略投资"],
        },
        {
            "投资方": [],
            "被投资方": ["壹平方米"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["获A轮"],
        },
        {
            "投资方": [],
            "被投资方": ["工机管家"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["战略投资"],
        },
        {
            "投资方": [],
            "被投资方": ["江波龙电子FORESEE"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["战略投资"],
        },
        {
            "投资方": [],
            "被投资方": ["奇梦者"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["A+轮"],
        },
        {
            "投资方": [],
            "被投资方": ["晟捷科技"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["B轮"],
        },
        {
            "投资方": [],
            "被投资方": ["移芯通信"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["A+轮"],
        },
        {
            "投资方": [],
            "被投资方": ["航天龙梦"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["A+轮"],
        },
        {
            "投资方": [],
            "被投资方": ["买条活鲜"],
            "融资金额": ["数百万人民"],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["EpicentRx Inc"],
            "融资金额": ["3500万美元"],
            "披露时间": [],
            "融资轮次": ["D"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["大橡科技"],
            "融资金额": ["1000万人民币"],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Wayve"],
            "融资金额": ["2000万美元"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["云蝠智能"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["天使轮"],
        },
        {
            "投资方": [],
            "被投资方": ["上海晓花"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["A轮"],
        },
        {
            "投资方": [],
            "被投资方": ["NeuraMatrix"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["天使轮"],
        },
        {
            "投资方": [],
            "被投资方": ["般若生物"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["Pre-A轮"],
        },
        {
            "投资方": [],
            "被投资方": ["唐诚科技"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["天使轮"],
        },
        {
            "投资方": [],
            "被投资方": ["商桥物流"],
            "融资金额": ["1亿人民币"],
            "披露时间": [],
            "融资轮次": ["A+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Trials.ai"],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": ["种子"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["种子轮"],
        },
        {
            "投资方": [],
            "被投资方": ["Kikoko"],
            "融资金额": ["800万美元"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0051ef5df388b89e53774268fc0a306f": [
        {
            "投资方": [],
            "被投资方": ["曹操出行"],
            "融资金额": ["38亿元"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": ["2021年9月6日"],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": ["中信集团"],
            "被投资方": ["T3出行"],
            "融资金额": ["超50亿元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": ["9月23日"],

            "领投方": ["中信集团"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "00526561d0d8341d9cc5026676bbd735": [],
    "0054c1f3eccf47ce6a9d17dd3159fab9": [
        {
            "投资方": [],
            "被投资方": ["言安堂"],
            "融资金额": ["数千万人民币"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["燃点生物"],
            "融资金额": ["数千万人民币"],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["恒升医疗"],
            "融资金额": ["3亿人民币"],
            "披露时间": [],
            "融资轮次": ["A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["TalkingData"],
            "融资金额": ["1亿美元"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["优脑银河"],
            "融资金额": ["亿元及以上人民币"],
            "披露时间": [],
            "融资轮次": ["Pre-A"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["百布"],
            "融资金额": ["1.1亿美元"],
            "披露时间": [],
            "融资轮次": ["D+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["易达货栈"],
            "融资金额": ["3500万人民币"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Perfect Corp"],
            "融资金额": ["5000万美元"],
            "披露时间": [],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["Uppervoid"],
            "融资金额": ["数百万美元"],
            "披露时间": [],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["地平线"],
            "融资金额": ["4亿美元"],
            "披露时间": [],
            "融资轮次": ["C+"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["玩美移动PerfectCorp"],
            "融资金额": ["5000万美元"],
            "披露时间": [],
            "融资轮次": ["C"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["闪开来电"],
            "融资金额": ["数千万人民币"],
            "披露时间": [],
            "融资轮次": ["B"],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        },
        {
            "投资方": [],
            "被投资方": ["天戏互娱"],
            "融资金额": ["3.6亿人民币"],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ],
    "0058153f050403bcf37a1f7cf78e9649": [
        {
            "投资方": ["创享投资", "立创商城"],
            "被投资方": ["列拓科技"],
            "融资金额": ["数千万元"],
            "披露时间": ["11月11日"],
            "融资轮次": ["天使"],
            "事件时间": [],

            "领投方": ["创享投资"],
            "估值": [],
            "财务顾问": [],
            "trigger": ["融资"],
        }
    ]
}

example = {
            "投资方": [],
            "被投资方": [],
            "融资金额": [],
            "披露时间": [],
            "融资轮次": [],
            "事件时间": [],

            "领投方": [],
            "估值": [],
            "财务顾问": [],
            "trigger": [],
        }

def evaluation():
    from pytorch.knowledge_graph.entity_kg import is_not_valid
    print("document num {}".format(len(event_label)))
    pre_num = 0.0
    hit_num = 0.0
    real_num = 0.0
    for item_id, res in event_label.items():
        item = df[df["trz_id"]==item_id]

        true_ans = event_label[item_id]
        real_num += len(true_ans)
        if item.shape[0] < 1:

            continue
        # print(true_ans)
        pre_res = [{"投资方": sub_item["investor"],
                    "被投资方": sub_item["investee"],
                    "融资金额": sub_item["invest_amount"],
                    # "披露时间": sub_item["disclosure_time"],
                    "融资轮次": sub_item["invest_round"],
                    # "事件时间": sub_item["event_time"],
                    "领投方": sub_item["lead_investor"],
                    "估值": sub_item["invest_valuation"]} for idv, sub_item in item.iterrows() ]
                   # if isinstance(sub_item["investee"], str) and not is_not_valid(sub_item["investee"])]

        print(pre_res)
        print(true_ans)
        pre_num += len(pre_res)

        hit_num += match_pre_real(pre_res, true_ans)

    print(eval_metrix(hit_num, real_num, pre_num))




def match_pre_real(input_pre, input_real):
    def fm(input_value):
        if isinstance(input_value, float):
            return ""
        return input_value
    real_set = set()
    for item in input_real:
        item["投资方"].sort()
        # item_investor = item["投资方"]
        item_key = ("、".join(item["投资方"]), "、".join(item["被投资方"]), "、".join(item["融资金额"]),
                    # "、".join(item["披露时间"]),
                    "、".join(item["融资轮次"]),
                    # "、".join(item["事件时间"]),
                    "、".join(item["领投方"]), "、".join(item["估值"]))
        real_set.add(item_key)
    pre_set = set()
    for item in input_pre:
        item_investor = fm(item["投资方"]).split("、")
        item_investor.sort()

        item_key = ("、".join(item_investor), fm(item["被投资方"]), fm(item["融资金额"]),
                    # fm(item["披露时间"]),
                    fm(item["融资轮次"]),
                    # fm(item["事件时间"]),
                    fm(item["领投方"]), fm(item["估值"]))
        # print(item_key)
        pre_set.add(item_key)
    hit_num = len(real_set & pre_set)

    return hit_num




if __name__ == "__main__":
    evaluation()
