#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Copyright (c) ***
content1 = """
    各市（区）工信局、姑苏区经科局、工业园区经发委、高新区经发委：

现将省工信厅《关于组织开展第三批国家级服务型制造示范遴选工作的通知》（苏工信服务〔2021〕148号）转发给你们（附件1），请做好组织申报工作，相关要求如下：

一、申报条件及推荐名额

（一）示范企业

1、申报主体需获评省级服务型制造示范企业，服务收入占企业营业收入比重达30%以上；

2、各地同一种服务型制造模式的企业限推荐1家，总数不超过3家。

（二）示范平台

申报平台应为从制造业企业衍生出的服务平台或第三方专业服务平台，也可为高等院校、科研院所、行业组织等服务机构。截至申报日正式投入运营时间须满2年。分为共享制造类和其他类，各地可推荐平台总数不超过3家。

1、共享制造类

申报平台应围绕制造资源的在线发布、订单匹配、生产管理、支付保障、信用评价等，具有“平台接单、按工序分解、多工厂协同”的共享制造模式，能有效提升相关行业、区域制造资源的集聚和共享水平。

2、其他类

申报平台应具备在线服务、线上线下联动等功能，能够有效提升制造效率和能力，有效降低企业间交易成本和合作风险。

（三）示范项目

申报项目应围绕相关产业集群的共性制造需求，建设共享工厂、共性技术中心，为产业集群内企业提供共享物流、仓储、采销、人力等服务，促进集群内生产组织效率提升。示范项目不限推荐名额。

二、申报流程

1、请各地对照工信部通知要求，指导申报单位填报有关材料，确保申报材料要件齐全、内容完整。请于4月27日前将各类申报书（一式四份，盖企业公章即可）及相关电子版材料报送至市工信局技术创新处，同时填报汇总表并行文，逾期将不予推荐。

2、省工信厅将于5月中旬组织开展评审，确定最终推荐名单。届时获得推荐资格的企业需在线填报有关申报材料，经省级账号推荐后在线下载申报书（确保填报的电子版与纸质版材料一致）并加盖公章，于5月下旬再次报送省厅。

三、其他事项

为进一步做好申报工作，工信部政法司补充发布了申报指南（附件2），请申报主体仔细参考申报指南的第三部分“各类示范申报说明”及第五部分“常见问题答疑”，做好申报材料的归纳梳理。

四、各地工信部门联系方式

苏州市工信局       0512-68616275

张家港市工信局     0512-56729023

常熟市工信局       0512-51530329

太仓市工信局       0512-53572327

昆山市工信局       0512-57501689

吴江区工信局       0512-63982173

吴中区工信局       0512-65287617

相城区工信局       0512-85181462

姑苏区经科局       0512-68727612

工业园区经发委     0512-66681027

高新区经发委       0512-68750945
"""

content2 = """
各有关单位：

为贯彻落实苏州市委十二届十一次全会精神，奋力肩负起“争当表率、争做示范、走在前列”的新使命，深入实施创新驱动发展战略，着力打造科技强市和建设“创业者乐园，创新者天堂”，为苏州打造向世界展示社会主义现代化的“最美窗口”提供有力科技支撑，现启动2021年苏州市科技发展计划（第二批）项目的组织申报，涉及重点产业技术创新、农业科技创新、社会发展科技创新等项目，现将苏州高新区有关项目申报组织事项通知如下：

一、申报方式

2021年度苏州市科技发展计划项目申报采取自主申报、初审推荐方法。各申报单位按照本批次中重点产业技术创新、农业科技创新、社会发展科技创新项目指南和申报通知自主申报，并提交申报材料。区科创局会同区企服中心对区内申报单位提交的项目进行审核，其中限额申报项目将另行组织专家进行评审，择优推荐上报。

二、申报要求

1.申报单位应在苏州市高新区行政区域内设立、登记、注册并具有独立法人资格，在相关领域具有一定的研发创新基础和优势，有健全的科研管理、知识产权管理和财务管理制度，运营状态良好。项目第一负责人须为项目申报单位的在职人员（与申报单位签订劳动合同），并确保在职期间能完成项目任务。

2.申报的项目应具有明确的实施内容、实施进度、考核指标、经费预算等，不涉及国家机密、商业秘密和个人隐私等。

3.申报单位应科学预测项目实施预期目标和成效，并根据《苏州市科技发展计划项目经费预算编制说明》（附件2）的要求，合理测算新增投入和子科目预算。2021年立项资助的应用基础研究项目和基础研究试点项目按照《苏州市科技计划项目经费使用“包干制”实施方案》（见附件3）规定，开展经费使用“包干制”改革，只编报项目经费预算总额，无需编制项目支出预算科目。

4.全面实施科研诚信承诺制，严格按照《关于加快推进社会信用体系建设构建以信用为基础的新型监管机制的实施办法》（苏府办〔2020〕232号）和《苏州市科技计划项目信用管理办法》（苏科规〔2020〕2号）等有关要求，项目负责人、项目申报单位和项目主管部门均须在项目申报时签署科研诚信承诺书（见附件1），严禁剽窃他人科研成果、侵犯他人知识产权、伪造材料骗取申报资格等科研不端及失信行为。因不良信用记录正在接受处罚的单位和个人，不得申报本年度计划项目。

5.项目申报单位对申报材料的真实性和合法性负有法人主体责任，严禁虚报项目、虚假出资、虚构事实及包装项目等弄虚作假行为。

6.积极开发科研助理岗位。鼓励市科技计划项目承担单位结合承担项目和经费等情况设置科研助理岗位，采取包括签订服务协议等多种方式选聘科研助理，在所承担的市科技项目中积极吸纳高校毕业生参与科研相关工作。科研助理的相关经费支出可按规定从项目经费中列支。

7.网上填报的项目申报材料是后续形式审查、项目评审的依据，且须与纸质项目申报材料一致。

8.2021年度重点产业技术创新、农业科技创新、社会发展科技创新项目详细申报要求详见附件4-6。

三、申报系统

苏州市科技局网站（http://kjj.suzhou.gov.cn）点击“苏州科技计划项目管理系统”，或登录“苏州市财政专项资金申报平台”（http://www.szzxzjsb.com）点击“苏州市科技局”图标进入。

四、申报限制

1．有下列情况之一的项目负责人不得申报本批次各类科技计划项目：

（1）截至2021年5月31日，承担的市级科技计划项目已超期6个月且尚未完成验收的；

（2）承担省、市级科技计划在研项目2项及以上的；

（3）在苏州市公共信用信息数据库内存在社会信用严重失信记录的；

（4）列为科技信用严重失信的。

2.有下列情况之一的单位不得申报本批次各类科技计划项目：

（1）在苏州市公共信用信息数据库内存在社会信用严重失信记录的；

（2）未按照要求完成科技统计的；

（3）完成科技统计但没有研发投入、研发人员的；

（4）列为科技信用严重失信的；

（5）项目申报材料或项目验收材料、后补助评估材料可能涉及国家秘密的。

3.同一单位以及关联单位不得将内容相同或相近的研发项目同时申报不同的竞争择优类科技计划。凡属重复申报的，取消评审立项资格。

五、材料提交

1.重点产业技术创新项目网络申报截止时间：2021年7月20日17:00；

  纸质材料一式一份提交截止时间：2021年7月23日17:00。

2.农业科技创新项目申报截止时间：2021年7月07日17:00；

  纸质材料一式两份提交截止时间：2021年7月11日17:00。

3.社会发展科技创新项目网络申报截止时间：2021年7月12日17:00；

  纸质材料一式两份提交截止时间：2021年7月18日17:00。

3.纸质材料提交地址：锦峰路199号锦峰商务广场A座2楼企业服务中心

六、申报咨询

苏州高新区企业服务中心  梅  琳 68756226

邵家成68754038

苏州高新区科创局高新处  周一君 68751593

                        马春黎 68751569

    苏州高新区科创局成果处  刘  伟 68751565
"""

content3 = """区内各有关单位：

根据苏州市科技局《关于组织申报2021年度苏州市科技金融计划项目的通知》，为贯彻落实苏州市委十二届十一次全会精神，奋力肩负起“争当表率、争做示范、走在前列”的新使命，深入实施创新驱动发展战略，进一步发挥科技金融促进科技创新能力提升的倍增效应，着力破解科技型企业融资难题、降低企业创新风险，根据《市政府关于加强科技金融结合促进科技型企业发展的若干意见》（苏府〔2018〕96号）等文件精神,现组织区内科技型企业开展2021年度苏州市科技金融计划项目申报工作，具体通知如下：

一、科技信贷

（一）苏州市市级科技信贷风险补偿项目（“科贷通”）

苏州市市级科技信贷风险补偿项目用于补偿合作银行、经地方金融主管部门审核批准设立的科技小额贷款公司等金融（服务）机构以“科贷通”形式为我市科技型企业放贷所产生的损失。对苏州市“独角兽”培育企业、市级以上领军人才企业，科技信贷风险补偿额不超过1000万元；对于市级“瞪羚计划”企业，科技信贷风险补偿额不超过700万元；对于其它科技型企业，科技信贷风险补偿额不超过500万元。

1.申报对象

企业在苏州高新区登记注册，具有独立法人资格；守法经营、诚实守信、近三年内无严重失信行为；企业符合以下条件之一，并在苏州市科技金融生态圈平台完成入库：

（1）经江苏省民营科技企业协会备案认定的江苏省民营科技企业；

（2）经国家科技型中小企业评价系统认定的科技型中小企业；

（3）高新技术企业或高新技术培育企业；

（4）市级“瞪羚计划”企业；

（5）苏州市“独角兽”培育企业；

（6）获得各级人才计划资助的领军人才企业。

2.申报流程

采取网上和纸质申报相结合的方式，网上申报与纸质申报内容必须完全一致。

申报企业登陆苏州市科技局网站（http://kjj.suzhou.gov.cn）点击“苏州科技计划项目管理系统”，或登录“苏州市财政专项资金申报平台”（http://www.szzxzjsb.com）点击“苏州市科技局”图标进入，选择“苏州市科技金融生态圈平台（http://kjjr.kjj.suzhou.com.cn/）”，发布贷款需求，与合作银行进行业务对接。合作银行放贷后，将相关纸质申报材料报苏州市科技创新创业投资有限公司（以下简称“市科创投”）备案。

3.申报要求

（1）申报时间：常年申请、集中受理，合作银行按月向市科创投进行备案。

（2）申报材料：《风险补偿资金申请表（企业联）》（网上打印）、《风险补偿资金申请表（银行联）》（网上打印）、贷款合同等。

（二）科技贷款利息（含担保费）补贴

苏州市市级科技贷款贴息项目用于补助苏州市区科技型企业在实施各级科技计划项目期间，使用银行、经地方金融主管部门审核批准设立的科技小额贷款公司的科技贷款所发生的贷款利息支出，以及使用专业担保公司为科技贷款进行担保而产生的担保费用进行补贴。贴息项目采取总额控制和后补助方式。根据申报企业上年度实际支付利息（含担保费）给予最高50%的一次性补贴。重点支持苏州市“独角兽”培育企业、市级“瞪羚计划”企业，高新技术企业、市级以上科技人才计划资助的领军人才企业、首次申报企业。单户企业年度补贴比例最高为企业实际支出的50%，对于苏州市“独角兽”培育企业，单户企业当年度贴息补助总额最高为100万元；对于市级“瞪羚计划”企业，单户企业当年度贴息补助总额最高为50万元；对于其它科技型企业，单户企业当年度贴息补助总额最高30万元。

1.申报对象

企业在苏州高新区登记注册，具有独立法人资格；守法经营、诚实守信、近三年内无严重失信行为；企业符合以下条件之一，并在苏州市科技金融生态圈平台完成入库：

（1）经江苏省民营科技企业协会备案认定的江苏省民营科技企业；

（2）经国家科技型中小企业评价系统认定的科技型中小企业；

（3）高新技术企业或高新技术培育企业；

（4）市级“瞪羚计划”企业；

（5）苏州市“独角兽”培育企业；

（6）获得各级人才计划资助的领军人才企业。

2.申报条件

（1）科技贷款记录已在苏州市科技金融生态圈平台完成备案。

（2）申请补贴的贷款利息须为企业实施2018年后各级科技项目（含“科贷通”）而使用金融机构贷款所发生的利息（含担保费）。

（3）利息支出期限为2020年1月1日至2020年12月31日之间。

3.申报流程：

采取网上和纸质申报相结合的方式，网上申报与纸质申报内容必须完全一致。申报单位登陆苏州市科学技术局门户网站，点击“苏州市科技金融生态圈平台”进入，提交科技贷款贴息补贴申请，并将纸质申报材料报送至所属苏州高新区科技金融服务中心。

4.申报要求

（1）申报时间：申报企业于2021年4月23日前（请尽量提前），完成网上申报。经区科技金融服务中心审核通过后，于4月30日前将纸质材料报送至苏州高新区科技金融服务中心。

（2）申报材料：按照以下顺序书本式装订纸质申报材料，在封面（网上打印）加盖企业公章，并加盖骑缝章：

①苏州市科技贷款贴息资金资助申请表（网上打印，需区科技局盖章）。

②项目信息表（网上打印）。

③贷款合同、贷款到账凭证、企业结息汇总表（网上打印）和付息凭证，如有担保费支出的，还应提供担保合同和担保费支付凭证。（同时具备，一一对应）

④上年度财务报告和最近一期的财务报表。（加盖企业公章）

⑤科技项目立项文件等。（复印件）

（3）申报材料装订要求：一式两份，胶装订成书册状



二、科技保险费补贴

苏州市科技保险费补贴项目对苏州市区科技型企业向我市保险机构购买经苏州市科技金融生态圈平台备案的科技保险险种所支出的保险费给予补贴。保费补贴项目采取后补贴方式，实行总额限制和分类补贴，重点支持首次申报的企业。根据申报企业申请的险种给予最高50%的科技保险费补贴，每户企业当年度科技保险费补贴最高30万元。

1.申报对象

企业在苏州高新区登记注册，具有独立法人资格；守法经营、诚实守信、近三年内无严重失信行为；企业符合以下条件之一，并在苏州市科技金融生态圈平台完成入库：

（1）经江苏省民营科技企业协会备案认定的江苏省民营科技企业；

（2）经国家科技型中小企业评价系统认定的科技型中小企业；

（3）高新技术企业或高新技术培育企业；

（4）市级“瞪羚计划”企业；

（5）苏州市“独角兽”培育企业；

（6）获得各级人才计划资助的领军人才企业。

2.申报条件

（1）科技保险记录已在苏州市科技金融生态圈平台完成备案。

（2）投保险种属于产品责任保险、产品质量保证保险、小额贷款保证保险、高新技术企业研发责任保险、高新技术企业高管人员和关键研发人员健康保险及意外伤害保险、高新技术企业关键研发设备保险、环境污染责任保险、董事会监事会高级管理人员责任保险、营业中断保险、专利保险、项目投资损失保险、高新技术企业财产险、雇主责任保险等科技保险范围。

(3)本年度支持保险合同到期日处于2020年度，且科技保险费补贴申报项目仅限缴足全部保险费。申报贷款保证类保险补贴的，须待还本付息后才能申报补贴。

3.申报流程

采取网上和纸质申报相结合的方式，网上申报与纸质申报内容必须完全一致。

申报企业登陆苏州市科学技术局门户网站，点击“苏州市科技金融生态圈平台”进入，提交科技保险费补贴申请，并将纸质申报材料报送至苏州高新区科技金融服务中心。

4.申报要求

（1）申报时间：申报企业于2021年4月23日前(请尽量提前)，完成网上申报。经区科技金融服务中心审核通过后，于4月30日前将纸质材料报送至苏州高新区科技金融服务中心。

（2）申报材料：按照以下顺序胶印装订纸质申报材料，在封面（网上打印）加盖申请企业及保险公司业务章，并加盖骑缝章：

①苏州市科技保险补贴资金申请表（网上打印，需区科技局盖章）。

②科技保险合同和科技保险费发票（盖保险公司业务章），如为小额贷款保证保险补贴的，应提供贷款合同以及还本付息凭证。

③上年度财务报告。（加盖企业公章）

（3）申报材料装订要求：一式两份，胶装订成书册状

三、天使投资奖励补贴

苏州市天使投资奖励补贴项目用于对投资于我市初创期科技型企业的天使投资企业委托管理的投资管理企业进行奖励补贴。奖励补贴按照实际投资金额（限于货币出资）给予1%的奖励，单个投资项目奖励补贴最高10万元，每家投资管理企业每年奖励补贴最高100万元。

1.申报对象

在苏州高新区范围内注册登记并在中国证券投资基金业协会或江苏省发改委备案的投资管理企业。投资管理企业所管理的创业投资企业也须在中国证券投资基金业协会或江苏省发改委等部门备案。

2.申报条件

向我市初创期科技型企业投资满一年（以被投资企业工商登记变更为准），并已在苏州市科技金融生态圈平台完成投资备案的项目。投资日期为2019年1月1日至2019年12月31日之间。

初创期科技型企业，是指企业在苏州高新区内登记注册，具有独立法人资格；主要在国家、省、市重点发展的高新技术产业、战略性新兴产业领域内，从事高新技术产品研究、开发、生产、服务或从事商业模式创新等，成立期限在5年（60个月）以内的非上市企业；投资时上一年度销售额在3000万元以下或净资产在2000万元以下;在苏州市科技金融生态圈平台完成入库，并符合以下条件之一：

（1）经江苏省民营科技企业协会备案认定的江苏省民营科技企业；

（2）获得科技管理部门赋予科技型中小企业入库登记编号的企业；

（3）高新技术企业或高新技术培育企业；

（4）苏州市“独角兽”培育企业；

（5）获得各级人才计划资助的领军人才企业。

3.申报流程

采取网上和纸质申报相结合的方式，网上申报与纸质申报内容必须完全一致。

申报企业登陆苏州市科学技术局门户网站，点击“苏州市科技金融生态圈平台”进入，提交奖励补贴申请，并将申报材料报送至苏州高新区科技金融服务中心。

4.申报要求

（1）申报时间：申报企业于2021年4月23日前(请尽量提前)，完成网上申报。经区科技金融服务中心审核通过后，于4月30日前将纸质材料报送至苏州高新区科技金融服务中心。

（2）申报材料：按照以下顺序书本式装订纸质申报材料，在封面（网上打印）加盖企业公章，并加盖骑缝章：

①苏州市天使投资奖励补贴申请表（网上打印）；

②苏州市天使投资奖励补贴项目汇总表（网上打印）；

③已投资初创期科技型企业相关证明文件，包括：企业营业执照、银行入账凭证、工商变更核准通知书、投资协议、投资分析报告、投资前一年企业的审计报告、最近一个月财务报表；（加盖企业公章）

④委托管理相关证明材料；

⑤获得国家相关部门备案的证明文件。

（3）申报材料装订要求：一式两份，胶装订成书册状

四、联系方式

申报科技信贷、科技保险费补贴的企业请加入新区科技金融服务中心QQ群：222187802（备注企业名称和申请事项）;

（一）业务咨询：

苏州高新区科技金融服务中心朱怡/沈澔  68327305

苏州高新区科创局科技成果处      俞快       68751549

苏州市科技创新创业投资有限公司  邓立群     69330073

苏州市科技局高新处（科技金融处）夏斯泰     65227947

（二）材料受理：

1、“科贷通”报送地址：苏州自主创新广场（苏州市干将东路178号）1号楼205室。联系电话：69330073。

2、科技贷款贴息、科技保险费补贴、天使投资奖励补贴纸质材料报送地址：苏州高新区科技金融服务中心（苏州高新区锦峰路199号锦峰国际商务广场A幢二楼，苏州高新区企业服务中心8号窗口），电话：68327305

（三）技术支持：

苏州市科技创新创业投资有限公司   方镜茗   69330073"""


import requests
item_list = [
    ("http://www.snd.gov.cn/hqqrmzf/c108354/202103/121c2429329744679b9d0e58f5f7012e.shtml", "高新区关于组织申报2021年度苏州市科技金融计划项目的通知"),
    # ("http://jsszfhcxjst.jiangsu.gov.cn/art/2021/1/4/art_8639_9623745.html", "省住房城乡建设厅关于组织申报2021年度江苏省绿色建筑发展专项资金奖补项目的通知")
]
# url = "http://www.snd.gov.cn/hqqrmzf/c108354/202103/121c2429329744679b9d0e58f5f7012e.shtml"
save_path = "D:\data\\政策信息抽取"

for item in item_list[1:]:
    url = item[0]
    header = {
        "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.107 Safari/537.36"
    }
    r = requests.get(url, headers=header)

    if r.status_code != 200:
        print(r.status_code)
        continue

    file_name = "D:\data\\政策信息抽取\\{}.txt".format(item[1])
    with open(file_name, "wb") as f:
        f.write(r.content)

