#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Copyright (c) ***
data_list = [
    {
        "sentence": "1、上年度营业收入2500万元以上（含2500万元），或利税总额400万元以上（含400万元）；",
        "key_value_list": [
            {
                "key": "上年度营业收入",
                "value": "2500万元以上（含2500万元）"
            },
            {
                "key": "利税总额",
                "value": "400万元以上（含400万元）"
            }
        ]
    },
    {
        "sentence": "2、在相关细分产品市场中，拥有较高的市场地位和市场份额，单项产品市场占有率位居国内同行业前10位；",
        "key_value_list": [
            {
                "key": "单项产品市场占有率",
                "value": "位居国内同行业前10位"
            },
            {
                "key": "相关细分产品市场",
                "value": "拥有较高的市场地位和市场份额"
            }
        ]
    },
    {
        "sentence": "3、近三年营业收入平均增长率8%以上或平均营业利润率8%以上；",
        "key_value_list": [
            {
                "key": "近三年营业收入平均增长率",
                "value": "8%以上"
            },
            {
                "key": "平均营业利润率",
                "value": "8%以上"
            }
        ]
    },
    {
        "sentence": "4、拥有1项及以上发明专利（2项及以上实用新型专利），关键性能指标处于同类产品领先水平；",
        "key_value_list": [
            {
                "key": "发明专利",
                "value": "拥有1项及以上"
            },
            {
                "key": "发明专利",
                "value": "2项及以上实用新型专利"
            }
        ]
    },
    {
        "sentence": "5、建立苏州市级以上研发机构，研究开发费用占销售收入的比重不低于3%。",
        "key_value_list": [
            {
                "key": "研发机构",
                "value": "苏州市级以上"
            },
            {
                "key": "研究开发费用占销售收入的比重",
                "value": "不低于3%"
            }
        ]
    },
    {
        "sentence": "6.企业在市公共信用信息中心出具的企业信用报告无严重失信记录，具有较高的质量管理和信用管理水平。",
        "key_value_list": [
            {
                "key": "企业在市公共信用信息中心出具的企业信用报告",
                "value": "无严重失信记录"
            },
            {
                "key": "企业",
                "value": "具有较高的质量管理和信用管理水平"
            }
        ]
    },
    {
        "sentence": "1、申报单位应在昆山市内注册、具有独立法人资格，具有健全的财务管理机构和制度，信用良好且无违法记录。",
        "key_value_list": [
            {
                "key": "注册",
                "value": "昆山市内"
            },
            {
                "key": "独立法人资格",
                "value": "具有"
            },
            {
                "key": "健全的财务管理机构和制度",
                "value": "具有"
            },
            {
                "key": "信用",
                "value": "良好"
            },
            {
                "key": "违法记录",
                "value": "无"
            }
        ]
    },
    {
        "sentence": "（四）未获得过中国专利奖；",
        "key_value_list": [
            {
                "key": "中国专利奖",
                "value": "未获得过"
            }
        ]
    },
    {
        "sentence": "（六）相同专利权人参评项目不超过2项；专利权人是国家知识产权示范高校的，参评项目不超过4项；集团公司及其子公司参评项目总数不超过10项。",
        "key_value_list": [
            {
                "key": "相同专利权人参评项目",
                "value": "不超过2项"
            },
            {
                "key": "专利权人是国家知识产权示范高校的，参评项目",
                "value": "不超过4项"
            },
            {
                "key": "集团公司及其子公司参评项目总数",
                "value": "不超过10项"
            }
        ]
    },
    {
        "sentence": "第一申请人注册地在苏州市区范围内的企业。",
        "key_value_list": [
            {
                "key": "第一申请人注册地",
                "value": "苏州市区范围内"
            }
        ]
    },
    {
        "sentence": "范围要求：申请人通过马德里体系取得指定国商标国际注册，保护起始日期为2020年1月1日至2020年12月31日。",
        "key_value_list": [
            {
                "key": "马德里体系取得指定国商标国际注册",
                "value": "通过"
            }
        ]
    },
    {
        "sentence": "范围要求：申请人通过马德里体系取得指定国商标国际注册，保护起始日期为2020年1月1日至2020年12月31日。",
        "key_value_list": [
            {
                "key": "马德里体系取得指定国商标国际注册",
                "value": "通过"
            }
        ]
    },
    {
        "sentence": "（一）具有苏州本地独立法人资格（含省属以上国有企业在苏分支机构）及从事相关服务的资质或能力。运营两年以上，资产总额不低于200万元，财务收支状况良好，经营规范，具有良好的发展前景和可持续发展能力。",
        "key_value_list": [
            {
                "key": "苏州本地独立法人资格",
                "value": "具有"
            },
            {
                "key": "运营",
                "value": "两年以上"
            },
            {
                "key": "资产总额",
                "value": "不低于200万元"
            },
            {
                "key": "财务收支状况",
                "value": "良好"
            },
            {
                "key": "经营",
                "value": "规范"
            },
            {
                "key": "发展前景和可持续发展能力",
                "value": "良好"
            }
        ]
    },
    {
        "sentence": "（二）服务业绩突出。年服务服贸企业20家以上，或年服务收入30万元以上（金融类除外），在专业服务领域或区域内有一定的声誉和品牌影响力。",
        "key_value_list": [
            {
                "key": "服务业绩",
                "value": "突出"
            },
            {
                "key": "年服务服贸企业",
                "value": "20家以上"
            },
            {
                "key": "年服务收入",
                "value": "30万元以上"
            },
            {
                "key": "专业服务领域或区域内",
                "value": "有一定的声誉和品牌影响力"
            }
        ]
    },
    {
        "sentence": "（四）有健全的管理制度，规范的服务流程、合理的收费标准和完善的服务质量保证措施；有明确的发展规划和年度服务目标。",
        "key_value_list": [
            {
                "key": "管理制度",
                "value": "健全"
            },
            {
                "key": "服务流程",
                "value": "规范"
            },
            {
                "key": "收费标准",
                "value": "合理"
            },
            {
                "key": "服务质量保证措施",
                "value": "完善"
            },
            {
                "key": "发展规划和年度服务目标",
                "value": "明确"
            }
        ]
    },
    {
        "sentence": "（五）有健全的管理团队和人才队伍。主要负责人要诚信、守法，具有开拓创新精神、丰富的实践经验和较高的管理水平；从事为企业服务的人员不少于20人，其中大专及以上学历和中级及以上技术职称专业人员的比例占80％以上。",
        "key_value_list": [
            {
                "key": "管理团队和人才队伍",
                "value": "健全"
            },
            {
                "key": "主要负责人",
                "value": "诚信、守法"
            },
            {
                "key": "主要负责人",
                "value": "开拓创新精神"
            },
            {
                "key": "主要负责人",
                "value": "丰富的实践经验和较高的管理水平"
            },
            {
                "key": "从事为企业服务的人员",
                "value": "不少于20人"
            },
            {
                "key": "大专及以上学历和中级及以上技术职称专业人员的比例",
                "value": "80％以上"
            }
        ]
    },
    {
        "sentence": "（一）在苏州市区内注册（生物医药相关项目、集成电路流片补贴项目等可放宽至大市范围），具有独立的法人资格。",
        "key_value_list": [
            {
                "key": "注册",
                "value": "苏州市区"
            },
            {
                "key": "法人资格",
                "value": "独立"
            }
        ]
    },
    {
        "sentence": "具有健全的财务管理机构和制度。",
        "key_value_list": [
            {
                "key": "财务管理机构和制度",
                "value": "健全"
            }
        ]
    },
    {
        "sentence": "1、基本条件。企业在江苏省内注册，具有独立的法人资格，并具备健全的财务管理机构和制度，信用良好、无违法记录。",
        "key_value_list": [
            {
                "key": "注册",
                "value": "江苏省内"
            },
            {
                "key": "法人资格",
                "value": "独立"
            },
            {
                "key": "财务管理机构和制度",
                "value": "健全"
            },
            {
                "key": "信用",
                "value": "良好"
            },
            {
                "key": "违法记录",
                "value": "无"
            }
        ]
    },
    {
        "sentence": "1、申报单位应在江苏省内注册、具有独立法人资格，具有健全的财务管理机构和制度，信用良好且无违法记录。",
        "key_value_list": [
            {
                "key": "注册",
                "value": "江苏省内"
            },
            {
                "key": "法人资格",
                "value": "独立"
            },
            {
                "key": "财务管理机构和制度",
                "value": "健全"
            },
            {
                "key": "信用",
                "value": "良好"
            },
            {
                "key": "违法记录",
                "value": "无"
            }
        ]
    },
    {
        "sentence": "注册在苏州工业园区的具有较强科创属性的中小微领军人才企业可以申请，须同时满足以下条件：",
        "key_value_list": [
            {
                "key": "注册",
                "value": "苏州工业园区"
            },
            {
                "key": "科创属性",
                "value": "较强"
            },
            {
                "key": "财务管理机构和制度",
                "value": "健全"
            },
            {
                "key": "信用",
                "value": "良好"
            },
            {
                "key": "违法记录",
                "value": "无"
            }
        ]
    },
    {
        "sentence": "1.符合园区“2+3+1”产业发展方向；",
        "key_value_list": [
            {
                "key": "园区“2+3+1”产业发展方向",
                "value": "符合"
            }
        ]
    },
    {
        "sentence": "企业成立时间须在2013年1月1日以后。其中，2016年1月1日之前成立的企业需取得科技型中小企业、省民营科技企业、高新技术企业、瞪羚、独角兽等至少一项企业相关资质认定，或其创办人已入选市级及以上重大人才工程；",
        "key_value_list": [
            {
                "key": "企业成立时间",
                "value": "2013年1月1日以后"
            },
            {
                "key": "企业相关资质认定",
                "value": "科技型中小企业、省民营科技企业、高新技术企业、瞪羚、独角兽等至少一项"
            },
            {
                "key": "市级及以上重大人才工程",
                "value": "创办人已入选"
            }
        ]
    },
    {
        "sentence": "1.基本条件。在工业园区登记注册，具有独立法人资格，企业成立十年以内；获得过私募股权投资或产业投资，且实缴到位；企业未上市（包括国内主板、中小板、创业板、科创板以及境外资本市场）；企业无不良信用记录。",
        "key_value_list": [
            {
                "key": "登记注册",
                "value": "工业园区"
            },
            {
                "key": "法人资格",
                "value": "独立"
            },
            {
                "key": "企业成立",
                "value": "十年以内"
            },
            {
                "key": "私募股权投资或产业投资",
                "value": "实缴到位"
            },
            {
                "key": "企业",
                "value": "未上市"
            }
        ]
    },
    {
        "sentence": "申报对象为苏州工业园区范围内注册的企业。申报条件分为基本条件和优选条件。申报对象应满足基本条件。",
        "key_value_list": [
            {
                "key": "注册",
                "value": "苏州工业园区范围内"
            }
        ]
    }


]
